stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
typedef struct  /*!< RADIO_CTRL Structure  */
{
  __IO uint32_t RADIO_CONTROL_ID;               /*!< (@ 0x00000000) RADIO_CONTROL_ID register                  */
  __IO uint32_t CLK32COUNT_REG;                 /*!< (@ 0x00000004) CLK32COUNT_REG register                    */
  __IO uint32_t CLK32PERIOD_REG;                /*!< (@ 0x00000008) CLK32PERIOD_REG register                   */
  __IO uint32_t CLK32FREQUENCY_REG;             /*!< (@ 0x0000000C) CLK32FREQUENCY_REG register                */
  __IO uint32_t RADIO_CONTROL_IRQ_STATUS;       /*!< (@ 0x00000010) RADIO_CONTROL_IRQ_STATUS register          */
  __IO uint32_t RADIO_CONTROL_IRQ_ENABLE;       /*!< (@ 0x00000014) RADIO_CONTROL_IRQ_ENABLE register          */
} RADIO_CTRL_TypeDef;                                   /*!< Size = 24 (0x18) */


/* =========================================================================================================================== */
/* ================                                     RRM                                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief RRM (RRM)
 */

typedef struct  /*!< RRM Structure  */
{
  __IO uint32_t RESERVED;
  __IO uint32_t RRM_CTRL;              /*!< (@ 0x00000004) RRM_CTRL register                     */
  __IO uint32_t RESERVED1[2];
  __IO uint32_t UDRA_CTRL0;            /*!< (@ 0x00000010) UDRA_CTRL0 register                   */
  __IO uint32_t UDRA_IRQ_ENABLE;       /*!< (@ 0x00000014) UDRA_IRQ_ENABLE register              */
  __IO uint32_t UDRA_IRQ_STATUS;       /*!< (@ 0x00000018) UDRA_IRQ_STATUS register              */
  __IO uint32_t UDRA_RADIO_CFG_PTR;    /*!< (@ 0x0000001C) UDRA_RADIO_CFG_PTR register           */
  __IO uint32_t SEMA_IRQ_ENABLE;       /*!< (@ 0x00000020) SEMA_IRQ_ENABLE register              */
  __IO uint32_t SEMA_IRQ_STATUS;       /*!< (@ 0x00000024) SEMA_IRQ_STATUS register              */
  __IO uint32_t BLE_IRQ_ENABLE;        /*!< (@ 0x00000028) BLE_IRQ_ENABLE register               */
  __IO uint32_t BLE_IRQ_STATUS;        /*!< (@ 0x0000002C) BLE_IRQ_STATUS register               */
  __IO uint32_t RESERVED2[12];
  __IO uint32_t VP_CPU_CMD_BUS;        /*!< (@ 0x00000060) VP_CPU_CMD_BUS register               */
  __IO uint32_t VP_CPU_SEMA_BUS;       /*!< (@ 0x00000064) VP_CPU_SEMA_BUS register              */
  __IO uint32_t VP_CPU_IRQ_ENABLE;     /*!< (@ 0x00000068) VP_CPU_IRQ_ENABLE register            */
  __IO uint32_t VP_CPU_IRQ_STATUS;     /*!< (@ 0x0000006C) VP_CPU_IRQ_STATUS register            */
  __IO uint32_t RESERVED3[36];
  __IO uint32_t AA0_DIG_USR;           /*!< (@ 0x00000100) AA0_DIG_USR register                  */
  __IO uint32_t AA1_DIG_USR;           /*!< (@ 0x00000104) AA1_DIG_USR register                  */
  __IO uint32_t AA2_DIG_USR;           /*!< (@ 0x00000108) AA2_DIG_USR register                  */
  __IO uint32_t AA3_DIG_USR;           /*!< (@ 0x0000010C) AA3_DIG_USR register                  */
  __IO uint32_t DEM_MOD_DIG_USR;       /*!< (@ 0x00000110) DEM_MOD_DIG_USR register              */
  __IO uint32_t RADIO_FSM_USR;         /*!< (@ 0x00000114) RADIO_FSM_USR register                */
  __IO uint32_t PHYCTRL_DIG_USR;       /*!< (@ 0x00000118) PHYCTRL_DIG_USR register              */
  __IO uint32_t RESERVED4[11];
  __IO uint32_t AFC1_DIG_ENG;          /*!< (@ 0x00000148) AFC1_DIG_ENG register                 */
  __IO uint32_t RESERVED5[2];
  __IO uint32_t CR0_DIG_ENG;           /*!< (@ 0x00000154) CR0_DIG_ENG register                  */
  __IO uint32_t RESERVED6[4];
  __IO uint32_t CR0_LR;                /*!< (@ 0x00000168) CR0_LR register                       */
  __IO uint32_t VIT_CONF_DIG_ENG;      /*!< (@ 0x0000016C) VIT_CONF_DIG_ENG register             */
  __IO uint32_t RESERVED7[5];
  __IO uint32_t LR_PD_THR_DIG_ENG;     /*!< (@ 0x00000184) LR_PD_THR_DIG_ENG register            */
  __IO uint32_t LR_RSSI_THR_DIG_ENG;   /*!< (@ 0x00000188) LR_RSSI_THR_DIG_ENG register          */
  __IO uint32_t LR_AAC_THR_DIG_ENG;    /*!< (@ 0x0000018C) LR_AAC_THR_DIG_ENG register           */
  __IO uint32_t RESERVED8[6];
  __IO uint32_t SYNTHCAL0_DIG_ENG;     /*!< (@ 0x000001A8) SYNTHCAL0_DIG_ENG register            */
  __IO uint32_t RESERVED9[17];
  __IO uint32_t DTB5_DIG_ENG;          /*!< (@ 0x000001F0) DTB5_DIG_ENG register                 */
  __IO uint32_t RESERVED10[16];
  __IO uint32_t MOD0_DIG_TST;          /*!< (@ 0x00000234) MOD0_DIG_TST register                 */
  __IO uint32_t MOD1_DIG_TST;          /*!< (@ 0x00000238) MOD1_DIG_TST register                 */
  __IO uint32_t MOD2_DIG_TST;          /*!< (@ 0x0000023C) MOD2_DIG_TST register                 */
  __IO uint32_t MOD3_DIG_TST;          /*!< (@ 0x00000240) MOD3_DIG_TST register                 */
  __IO uint32_t RESERVED11;
  __IO uint32_t RXADC_ANA_USR;         /*!< (@ 0x00000248) RXADC_ANA_USR register                */
  __IO uint32_t RESERVED12[2];
  __IO uint32_t LDO_ANA_ENG;           /*!< (@ 0x00000254) LDO_ANA_ENG register                  */
  __IO uint32_t RESERVED13[7];
  __IO uint32_t CBIAS0_ANA_ENG;        /*!< (@ 0x00000274) CBIAS0_ANA_ENG register               */
  __IO uint32_t CBIAS1_ANA_ENG;        /*!< (@ 0x00000278) CBIAS1_ANA_ENG register               */
  __IO uint32_t RESERVED14;
  __IO uint32_t SYNTHCAL0_DIG_OUT;     /*!< (@ 0x00000280) SYNTHCAL0_DIG_OUT register            */
  __IO uint32_t SYNTHCAL1_DIG_OUT;     /*!< (@ 0x00000284) SYNTHCAL1_DIG_OUT register            */
  __IO uint32_t SYNTHCAL2_DIG_OUT;     /*!< (@ 0x00000288) SYNTHCAL2_DIG_OUT register            */
  __IO uint32_t SYNTHCAL3_DIG_OUT;     /*!< (@ 0x0000028C) SYNTHCAL3_DIG_OUT register            */
  __IO uint32_t SYNTHCAL4_DIG_OUT;     /*!< (@ 0x00000290) SYNTHCAL4_DIG_OUT register            */
  __IO uint32_t SYNTHCAL5_DIG_OUT;     /*!< (@ 0x00000294) SYNTHCAL5_DIG_OUT register            */
  __IO uint32_t FSM_STATUS_DIG_OUT;    /*!< (@ 0x00000298) FSM_STATUS_DIG_OUT register           */
  __IO uint32_t RESERVED15[2];
  __IO uint32_t RSSI0_DIG_OUT;         /*!< (@ 0x000002A4) RSSI0_DIG_OUT register                */
  __IO uint32_t RSSI1_DIG_OUT;         /*!< (@ 0x000002A8) RSSI1_DIG_OUT register                */
  __IO uint32_t AGC_DIG_OUT;           /*!< (@ 0x000002AC) AGC_DIG_OUT register                  */
  __IO uint32_t DEMOD_DIG_OUT;         /*!< (@ 0x000002B0) DEMOD_DIG_OUT register                */
  __IO uint32_t RESERVED16[3];
  __IO uint32_t AGC0_DIG_ENG;          /*!< (@ 0x000002C0) AGC0_DIG_ENG register                 */
  __IO uint32_t AGC1_DIG_ENG;          /*!< (@ 0x000002C4) AGC1_DIG_ENG register                 */
  __IO uint32_t RESERVED17[8];
  __IO uint32_t AGC10_DIG_ENG;         /*!< (@ 0x000002E8) AGC10_DIG_ENG register                */
  __IO uint32_t AGC11_DIG_ENG;         /*!< (@ 0x000002EC) AGC11_DIG_ENG register                */
  __IO uint32_t AGC12_DIG_ENG;         /*!< (@ 0x000002F0) AGC12_DIG_ENG register                */
  __IO uint32_t AGC13_DIG_ENG;         /*!< (@ 0x000002F4) AGC13_DIG_ENG register                */
  __IO uint32_t AGC14_DIG_ENG;         /*!< (@ 0x000002F8) AGC14_DIG_ENG register                */
  __IO uint32_t AGC15_DIG_ENG;         /*!< (@ 0x000002FC) AGC15_DIG_ENG register                */
  __IO uint32_t AGC16_DIG_ENG;         /*!< (@ 0x00000300) AGC16_DIG_ENG register                */
  __IO uint32_t AGC17_DIG_ENG;         /*!< (@ 0x00000304) AGC17_DIG_ENG register                */
  __IO uint32_t AGC18_DIG_ENG;         /*!< (@ 0x00000308) AGC18_DIG_ENG register                */
  __IO uint32_t AGC19_DIG_ENG;         /*!< (@ 0x0000030C) AGC19_DIG_ENG register                */
  __IO uint32_t RESERVED18[5];
  __IO uint32_t RXADC_HW_TRIM_OUT;     /*!< (@ 0x00000324) RXADC_HW_TRIM_OUT register            */
  __IO uint32_t CBIAS0_HW_TRIM_OUT;    /*!< (@ 0x00000328) CBIAS0_HW_TRIM_OUT register           */
  __IO uint32_t RESERVED19;
  __IO uint32_t AGC_HW_TRIM_OUT;       /*!< (@ 0x00000330) AGC_HW_TRIM_OUT register              */
  __IO uint32_t RESERVED20[3];
  __IO uint32_t ANTSW_DIG0_USR;        /*!< (@ 0x00000340) ANTSW_DIG0_USR register               */
  __IO uint32_t ANTSW_DIG1_USR;        /*!< (@ 0x00000344) ANTSW_DIG1_USR register               */
  __IO uint32_t ANTSW_DIG2_USR;        /*!< (@ 0x00000348) ANTSW_DIG2_USR register               */
  __IO uint32_t ANTSW_DIG3_USR;        /*!< (@ 0x0000034C) ANTSW_DIG3_USR register               */
} RRM_TypeDef;                          /*!< Size = 848 (0x350) */


/* =========================================================================================================================== */
/* ================                                     WAKEUP                                                ================ */
/* =========================================================================================================================== */


/**
  * @brief Wakeup (WAKEUP)
  */

typedef struct  /*!< WAKEUP Structure  */
{
  __IO uint32_t RESERVED[2];
  __IO uint32_t WAKEUP_OFFSET[2];              /*!< (@ 0x00000008) WAKEUP_OFFSET register                    */
  __IO uint32_t ABSOLUTE_TIME;                 /*!< (@ 0x00000010) ABSOLUTE_TIME register                    */
  __IO uint32_t MINIMUM_PERIOD_LENGTH;         /*!< (@ 0x00000014) MINIMUM_PERIOD_LENGTH register            */
  __IO uint32_t AVERAGE_PERIOD_LENGTH;         /*!< (@ 0x00000018) AVERAGE_PERIOD_LENGTH register            */
  __IO uint32_t MAXIMUM_PERIOD_LENGTH;         /*!< (@ 0x0000001C) MAXIMUM_PERIOD_LENGTH register            */
  __IO uint32_t STATISTICS_RESTART;            /*!< (@ 0x00000020) STATISTICS_RESTART register               */
  __IO uint32_t BLUE_WAKEUP_TIME;              /*!< (@ 0x00000024) BLUE_WAKEUP_TIME register                 */
  __IO uint32_t BLUE_SLEEP_REQUEST_MODE;       /*!< (@ 0x00000028) BLUE_SLEEP_REQUEST_MODE register          */
  __IO uint32_t CM0_WAKEUP_TIME;               /*!< (@ 0x0000002C) CM0_WAKEUP_TIME register                  */
  __IO uint32_t CM0_SLEEP_REQUEST_MODE;        /*!< (@ 0x00000030) CM0_SLEEP_REQUEST_MODE register           */
  __IO uint32_t RESERVED2[3];
  __IO uint32_t WAKEUP_BLE_IRQ_ENABLE;         /*!< (@ 0x00000040) WAKEUP_BLE_IRQ_ENABLE register            */
  __IO uint32_t WAKEUP_BLE_IRQ_STATUS;         /*!< (@ 0x00000044) WAKEUP_BLE_IRQ_STATUS register            */
  __IO uint32_t WAKEUP_CM0_IRQ_ENABLE;         /*!< (@ 0x00000048) WAKEUP_CM0_IRQ_ENABLE register            */
  __IO uint32_t WAKEUP_CM0_IRQ_STATUS;         /*!< (@ 0x0000004C) WAKEUP_CM0_IRQ_STATUS register            */
} WAKEUP_TypeDef;                                  /*!< Size = 80 (0x50) */


