stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */
#define NVM_BASE               (0x10040000U) /*!< Main FLASH base address */
#define SRAM_BASE              (0x20000000U) /*!< SRAM base address */
#define PERIPH_BASE            (0x40000000U) /*!< Peripheral base address */


/*!< Memory, OTP bytes */

/* Base addresses */
#define SYSTEM_MEMORY_BASE     (0x10000000U)   /*!< System Memory : 6KB (0x10000000 - 0x100017FF)  */
#define OTP_AREA_BASE          (0x10001800U)   /*!< OTP area : 1kB (0x10001800 - 0x10001BFF)       */

#define SRAM0_BASE             SRAM_BASE                  /*!< SRAM0 (16 KB) base address          */
#define SRAM1_BASE             (SRAM_BASE + 0x00004000U)  /*!< SRAM1 (16 KB) base address          */
#define SRAM2_BASE             (SRAM_BASE + 0x00008000U)  /*!< SRAM2 (16 KB) base address          */
#define SRAM3_BASE             (SRAM_BASE + 0x0000C000U)  /*!< SRAM3 (16 KB) base address          */

/* End addresses */
#define SRAM0_END_ADDR         (0x20003FFFU)   /*!< RAM0  : 16KB (0x20000000 - 0x20003FFF)         */
#define SRAM1_END_ADDR         (0x20007FFFU)   /*!< RAM1  : 16KB (0x20004000 - 0x20007FFF)         */
#define SRAM2_END_ADDR         (0x2000BFFFU)   /*!< RAM0  : 16KB (0x20008000 - 0x2000BFFF)         */
#define SRAM3_END_ADDR         (0x2000FFFFU)   /*!< RAM1  : 16KB (0x2000C000 - 0x2000FFFF)         */

#define SYSTEM_MEMORY_END_ADDR (0x100017FFU)   /*!< System Memory : 6KB (0x10000000 - 0x100017FF)  */
#define OTP_AREA_END_ADDR      (0x10001BFFU)   /*!< OTP area : 1KB (0x10001800 - 0x10001BFF)       */

/*!< Peripheral memory map */
#define APB0PERIPH_BASE        PERIPH_BASE
#define APB1PERIPH_BASE       (PERIPH_BASE + 0x01000000U)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x08000000U)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x20000000U)


/*!< APB0 peripherals */
#define SYSCFG_BASE        (APB0PERIPH_BASE + 0x0000U)
#define FLASH_BASE         (APB0PERIPH_BASE + 0x1000U)
#define TIM2_BASE          (APB0PERIPH_BASE + 0x2000U)
#define IWDG_BASE          (APB0PERIPH_BASE + 0x3000U)
#define RTC_BASE           (APB0PERIPH_BASE + 0x4000U)
#define TIM16_BASE         (APB0PERIPH_BASE + 0x5000U)
#define TIM17_BASE         (APB0PERIPH_BASE + 0x6000U)

/*!< APB1 peripherals */
#define I2C1_BASE          (APB1PERIPH_BASE + 0x0000U)
#define USART1_BASE        (APB1PERIPH_BASE + 0x4000U)
#define LPUART1_BASE       (APB1PERIPH_BASE + 0x5000U)
#define ADC1_BASE          (APB1PERIPH_BASE + 0x6000U)
#define SPI3_BASE          (APB1PERIPH_BASE + 0x7000U)

/*!< AHB peripherals */
#define GPIOA_BASE                 (AHBPERIPH_BASE + 0x000000UL)
#define GPIOB_BASE                 (AHBPERIPH_BASE + 0x100000UL)
#define CRC_BASE                   (AHBPERIPH_BASE + 0x200000UL)
#define PKA_BASE                   (AHBPERIPH_BASE + 0x300000UL)
#define PKA_RAM_BASE               (AHBPERIPH_BASE + 0x300400UL)
#define RCC_BASE                   (AHBPERIPH_BASE + 0x400000UL)
#define PWR_BASE                   (AHBPERIPH_BASE + 0x500000UL)
#define RNG_BASE                   (AHBPERIPH_BASE + 0x600000UL)
#define DMA1_BASE                  (AHBPERIPH_BASE + 0x700000UL)
#define DMAMUX1_BASE               (AHBPERIPH_BASE + 0x800000UL)

#define DMA1_Channel1_BASE         (DMA1_BASE + 0x0008)
#define DMA1_Channel2_BASE         (DMA1_BASE + 0x001C)
#define DMA1_Channel3_BASE         (DMA1_BASE + 0x0030)
#define DMA1_Channel4_BASE         (DMA1_BASE + 0x0044)
#define DMA1_Channel5_BASE         (DMA1_BASE + 0x0058)
#define DMA1_Channel6_BASE         (DMA1_BASE + 0x006C)
#define DMA1_Channel7_BASE         (DMA1_BASE + 0x0080)
#define DMA1_Channel8_BASE         (DMA1_BASE + 0x0094)

#define DMAMUX1_Channel0_BASE      (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE      (DMAMUX1_BASE + 0x00000004)
#define DMAMUX1_Channel2_BASE      (DMAMUX1_BASE + 0x00000008)
#define DMAMUX1_Channel3_BASE      (DMAMUX1_BASE + 0x0000000C)
#define DMAMUX1_Channel4_BASE      (DMAMUX1_BASE + 0x00000010)
#define DMAMUX1_Channel5_BASE      (DMAMUX1_BASE + 0x00000014)
#define DMAMUX1_Channel6_BASE      (DMAMUX1_BASE + 0x00000018)
#define DMAMUX1_Channel7_BASE      (DMAMUX1_BASE + 0x0000001C)

/*!< APB2 peripherals */
#define BLUE_BASE                  (APB2PERIPH_BASE + 0x0000U)
#define RADIO_CTRL_BASE            (APB2PERIPH_BASE + 0x1000U)
#define RRM_BASE                   (APB2PERIPH_BASE + 0x1400U)
#define WAKEUP_BASE                (APB2PERIPH_BASE + 0x1800U)

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */


/* Peripherals available on APB0 bus */
#define SYSCFG                      ((SYSCFG_TypeDef*)           SYSCFG_BASE)
#define FLASH                       ((FLASH_TypeDef*)             FLASH_BASE)
#define TIM2                        ((TIM_TypeDef*)               TIM2_BASE)
#define IWDG                        ((IWDG_TypeDef*)               IWDG_BASE)
#define RTC                         ((RTC_TypeDef*)                 RTC_BASE)
#define TIM16                       ((TIM_TypeDef*)               TIM16_BASE)
#define TIM17                       ((TIM_TypeDef*)               TIM17_BASE)

/* Peripherals available on APB1 bus */
#define I2C1                        ((I2C_TypeDef*)                I2C1_BASE)
#define USART1                      ((USART_TypeDef*)            USART1_BASE)
#define LPUART1                     ((USART_TypeDef*)           LPUART1_BASE)
#define ADC1                        ((ADC_TypeDef*)                ADC1_BASE)
#define SPI3                        ((SPI_TypeDef*)                SPI3_BASE)

