stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    IDR    ===================================================== */
#define CRC_IDR_IDR_Pos                                                    (0UL)    /*!<CRC IDR: IDR (Bit 0) */
#define CRC_IDR_IDR_Msk                                                    (0xffffffffUL)   /*!< CRC IDR: IDR (Bitfield-Mask: 0xffffffff) */
#define CRC_IDR_IDR                                                        CRC_IDR_IDR_Msk
#define CRC_IDR_IDR_0                                                      (0x1U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_1                                                      (0x2U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_2                                                      (0x4U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_3                                                      (0x8U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_4                                                      (0x10U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_5                                                      (0x20U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_6                                                      (0x40U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_7                                                      (0x80U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_8                                                      (0x100U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_9                                                      (0x200U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_10                                                     (0x400U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_11                                                     (0x800U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_12                                                     (0x1000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_13                                                     (0x2000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_14                                                     (0x4000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_15                                                     (0x8000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_16                                                     (0x10000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_17                                                     (0x20000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_18                                                     (0x40000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_19                                                     (0x80000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_20                                                     (0x100000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_21                                                     (0x200000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_22                                                     (0x400000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_23                                                     (0x800000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_24                                                     (0x1000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_25                                                     (0x2000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_26                                                     (0x4000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_27                                                     (0x8000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_28                                                     (0x10000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_29                                                     (0x20000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_30                                                     (0x40000000U << CRC_IDR_IDR_Pos)
#define CRC_IDR_IDR_31                                                     (0x80000000UL << CRC_IDR_IDR_Pos)

/* =====================================================    CR    ===================================================== */
#define CRC_CR_REV_OUT_Pos                                                 (7UL)    /*!<CRC CR: REV_OUT (Bit 7) */
#define CRC_CR_REV_OUT_Msk                                                 (0x80UL)   /*!< CRC CR: REV_OUT (Bitfield-Mask: 0x01) */
#define CRC_CR_REV_OUT                                                     CRC_CR_REV_OUT_Msk
#define CRC_CR_REV_IN_Pos                                                  (5UL)    /*!<CRC CR: REV_IN (Bit 5) */
#define CRC_CR_REV_IN_Msk                                                  (0x60UL)   /*!< CRC CR: REV_IN (Bitfield-Mask: 0x03) */
#define CRC_CR_REV_IN                                                      CRC_CR_REV_IN_Msk
#define CRC_CR_REV_IN_0                                                    (0x1U << CRC_CR_REV_IN_Pos)
#define CRC_CR_REV_IN_1                                                    (0x2U << CRC_CR_REV_IN_Pos)
#define CRC_CR_POLYSIZE_Pos                                                (3UL)    /*!<CRC CR: POLYSIZE (Bit 3) */
#define CRC_CR_POLYSIZE_Msk                                                (0x18UL)   /*!< CRC CR: POLYSIZE (Bitfield-Mask: 0x03) */
#define CRC_CR_POLYSIZE                                                    CRC_CR_POLYSIZE_Msk
#define CRC_CR_POLYSIZE_0                                                  (0x1U << CRC_CR_POLYSIZE_Pos)
#define CRC_CR_POLYSIZE_1                                                  (0x2U << CRC_CR_POLYSIZE_Pos)
#define CRC_CR_RESET_Pos                                                   (0UL)    /*!<CRC CR: RESET (Bit 0) */
#define CRC_CR_RESET_Msk                                                   (0x1UL)    /*!< CRC CR: RESET (Bitfield-Mask: 0x01) */
#define CRC_CR_RESET                                                       CRC_CR_RESET_Msk

/* =====================================================    INIT    ===================================================== */
#define CRC_INIT_CRC_INIT_Pos                                              (0UL)    /*!<CRC INIT: CRC_INIT (Bit 0) */
#define CRC_INIT_CRC_INIT_Msk                                              (0xffffffffUL)   /*!< CRC INIT: CRC_INIT (Bitfield-Mask: 0xffffffff) */
#define CRC_INIT_CRC_INIT                                                  CRC_INIT_CRC_INIT_Msk
#define CRC_INIT_CRC_INIT_0                                                (0x1U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_1                                                (0x2U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_2                                                (0x4U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_3                                                (0x8U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_4                                                (0x10U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_5                                                (0x20U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_6                                                (0x40U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_7                                                (0x80U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_8                                                (0x100U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_9                                                (0x200U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_10                                               (0x400U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_11                                               (0x800U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_12                                               (0x1000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_13                                               (0x2000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_14                                               (0x4000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_15                                               (0x8000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_16                                               (0x10000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_17                                               (0x20000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_18                                               (0x40000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_19                                               (0x80000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_20                                               (0x100000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_21                                               (0x200000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_22                                               (0x400000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_23                                               (0x800000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_24                                               (0x1000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_25                                               (0x2000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_26                                               (0x4000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_27                                               (0x8000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_28                                               (0x10000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_29                                               (0x20000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_30                                               (0x40000000U << CRC_INIT_CRC_INIT_Pos)
#define CRC_INIT_CRC_INIT_31                                               (0x80000000UL << CRC_INIT_CRC_INIT_Pos)

/* =====================================================    POL    ===================================================== */
#define CRC_POL_POL_Pos                                                    (0UL)    /*!<CRC POL: POL (Bit 0) */
#define CRC_POL_POL_Msk                                                    (0xffffffffUL)   /*!< CRC POL: POL (Bitfield-Mask: 0xffffffff) */
#define CRC_POL_POL                                                        CRC_POL_POL_Msk
#define CRC_POL_POL_0                                                      (0x1U << CRC_POL_POL_Pos)
#define CRC_POL_POL_1                                                      (0x2U << CRC_POL_POL_Pos)
#define CRC_POL_POL_2                                                      (0x4U << CRC_POL_POL_Pos)
#define CRC_POL_POL_3                                                      (0x8U << CRC_POL_POL_Pos)
#define CRC_POL_POL_4                                                      (0x10U << CRC_POL_POL_Pos)
#define CRC_POL_POL_5                                                      (0x20U << CRC_POL_POL_Pos)
#define CRC_POL_POL_6                                                      (0x40U << CRC_POL_POL_Pos)
#define CRC_POL_POL_7                                                      (0x80U << CRC_POL_POL_Pos)
#define CRC_POL_POL_8                                                      (0x100U << CRC_POL_POL_Pos)
#define CRC_POL_POL_9                                                      (0x200U << CRC_POL_POL_Pos)
#define CRC_POL_POL_10                                                     (0x400U << CRC_POL_POL_Pos)
#define CRC_POL_POL_11                                                     (0x800U << CRC_POL_POL_Pos)
#define CRC_POL_POL_12                                                     (0x1000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_13                                                     (0x2000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_14                                                     (0x4000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_15                                                     (0x8000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_16                                                     (0x10000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_17                                                     (0x20000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_18                                                     (0x40000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_19                                                     (0x80000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_20                                                     (0x100000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_21                                                     (0x200000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_22                                                     (0x400000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_23                                                     (0x800000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_24                                                     (0x1000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_25                                                     (0x2000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_26                                                     (0x4000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_27                                                     (0x8000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_28                                                     (0x10000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_29                                                     (0x20000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_30                                                     (0x40000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_31                                                     (0x80000000UL << CRC_POL_POL_Pos)


/* =========================================================================================================================== */
/*=====================                                       IWDG                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    KR    ===================================================== */
#define IWDG_KR_KEY_Pos                                                    (0UL)    /*!<IWDG KR: KEY (Bit 0) */
#define IWDG_KR_KEY_Msk                                                    (0xffffUL)   /*!< IWDG KR: KEY (Bitfield-Mask: 0xffff) */
#define IWDG_KR_KEY                                                        IWDG_KR_KEY_Msk
#define IWDG_KR_KEY_0                                                      (0x1U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_1                                                      (0x2U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_2                                                      (0x4U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_3                                                      (0x8U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_4                                                      (0x10U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_5                                                      (0x20U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_6                                                      (0x40U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_7                                                      (0x80U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_8                                                      (0x100U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_9                                                      (0x200U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_10                                                     (0x400U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_11                                                     (0x800U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_12                                                     (0x1000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_13                                                     (0x2000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_14                                                     (0x4000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_15                                                     (0x8000U << IWDG_KR_KEY_Pos)

