stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    PAGEPROT1    =====================================================*/
#define FLASH_PAGEPROT1_SEGOFFSET3_Pos                                     (24UL)   /*!<FLASH PAGEPROT1: SEGOFFSET3 (Bit 24) */
#define FLASH_PAGEPROT1_SEGOFFSET3_Msk                                     (0xff000000UL)   /*!< FLASH PAGEPROT1: SEGOFFSET3 (Bitfield-Mask: 0xff) */
#define FLASH_PAGEPROT1_SEGOFFSET3                                         FLASH_PAGEPROT1_SEGOFFSET3_Msk
#define FLASH_PAGEPROT1_SEGOFFSET3_0                                       (0x1U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_1                                       (0x2U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_2                                       (0x4U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_3                                       (0x8U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_4                                       (0x10U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_5                                       (0x20U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_6                                       (0x40U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET3_7                                       (0x80U << FLASH_PAGEPROT1_SEGOFFSET3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_Pos                                       (16UL)   /*!<FLASH PAGEPROT1: SEGSIZE3 (Bit 16) */
#define FLASH_PAGEPROT1_SEGSIZE3_Msk                                       (0xff0000UL)   /*!< FLASH PAGEPROT1: SEGSIZE3 (Bitfield-Mask: 0xff) */
#define FLASH_PAGEPROT1_SEGSIZE3                                           FLASH_PAGEPROT1_SEGSIZE3_Msk
#define FLASH_PAGEPROT1_SEGSIZE3_0                                         (0x1U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_1                                         (0x2U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_2                                         (0x4U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_3                                         (0x8U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_4                                         (0x10U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_5                                         (0x20U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_6                                         (0x40U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGSIZE3_7                                         (0x80U << FLASH_PAGEPROT1_SEGSIZE3_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_Pos                                     (8UL)    /*!<FLASH PAGEPROT1: SEGOFFSET2 (Bit 8) */
#define FLASH_PAGEPROT1_SEGOFFSET2_Msk                                     (0xff00UL)   /*!< FLASH PAGEPROT1: SEGOFFSET2 (Bitfield-Mask: 0xff) */
#define FLASH_PAGEPROT1_SEGOFFSET2                                         FLASH_PAGEPROT1_SEGOFFSET2_Msk
#define FLASH_PAGEPROT1_SEGOFFSET2_0                                       (0x1U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_1                                       (0x2U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_2                                       (0x4U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_3                                       (0x8U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_4                                       (0x10U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_5                                       (0x20U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_6                                       (0x40U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGOFFSET2_7                                       (0x80U << FLASH_PAGEPROT1_SEGOFFSET2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_Pos                                       (0UL)    /*!<FLASH PAGEPROT1: SEGSIZE2 (Bit 0) */
#define FLASH_PAGEPROT1_SEGSIZE2_Msk                                       (0xffUL)   /*!< FLASH PAGEPROT1: SEGSIZE2 (Bitfield-Mask: 0xff) */
#define FLASH_PAGEPROT1_SEGSIZE2                                           FLASH_PAGEPROT1_SEGSIZE2_Msk
#define FLASH_PAGEPROT1_SEGSIZE2_0                                         (0x1U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_1                                         (0x2U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_2                                         (0x4U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_3                                         (0x8U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_4                                         (0x10U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_5                                         (0x20U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_6                                         (0x40U << FLASH_PAGEPROT1_SEGSIZE2_Pos)
#define FLASH_PAGEPROT1_SEGSIZE2_7                                         (0x80U << FLASH_PAGEPROT1_SEGSIZE2_Pos)

/* =====================================================    DATA0    =====================================================*/
#define FLASH_DATA0_DATA0_Pos                                              (0UL)    /*!<FLASH DATA0: DATA0 (Bit 0) */
#define FLASH_DATA0_DATA0_Msk                                              (0xffffffffUL)   /*!< FLASH DATA0: DATA0 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA0_DATA0                                                  FLASH_DATA0_DATA0_Msk
#define FLASH_DATA0_DATA0_0                                                (0x1U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_1                                                (0x2U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_2                                                (0x4U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_3                                                (0x8U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_4                                                (0x10U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_5                                                (0x20U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_6                                                (0x40U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_7                                                (0x80U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_8                                                (0x100U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_9                                                (0x200U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_10                                               (0x400U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_11                                               (0x800U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_12                                               (0x1000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_13                                               (0x2000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_14                                               (0x4000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_15                                               (0x8000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_16                                               (0x10000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_17                                               (0x20000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_18                                               (0x40000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_19                                               (0x80000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_20                                               (0x100000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_21                                               (0x200000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_22                                               (0x400000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_23                                               (0x800000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_24                                               (0x1000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_25                                               (0x2000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_26                                               (0x4000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_27                                               (0x8000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_28                                               (0x10000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_29                                               (0x20000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_30                                               (0x40000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_31                                               (0x80000000UL << FLASH_DATA0_DATA0_Pos)

/* =====================================================    DATA1    =====================================================*/
#define FLASH_DATA1_DATA1_Pos                                              (0UL)    /*!<FLASH DATA1: DATA1 (Bit 0) */
#define FLASH_DATA1_DATA1_Msk                                              (0xffffffffUL)   /*!< FLASH DATA1: DATA1 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA1_DATA1                                                  FLASH_DATA1_DATA1_Msk
#define FLASH_DATA1_DATA1_0                                                (0x1U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_1                                                (0x2U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_2                                                (0x4U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_3                                                (0x8U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_4                                                (0x10U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_5                                                (0x20U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_6                                                (0x40U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_7                                                (0x80U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_8                                                (0x100U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_9                                                (0x200U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_10                                               (0x400U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_11                                               (0x800U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_12                                               (0x1000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_13                                               (0x2000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_14                                               (0x4000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_15                                               (0x8000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_16                                               (0x10000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_17                                               (0x20000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_18                                               (0x40000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_19                                               (0x80000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_20                                               (0x100000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_21                                               (0x200000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_22                                               (0x400000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_23                                               (0x800000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_24                                               (0x1000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_25                                               (0x2000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_26                                               (0x4000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_27                                               (0x8000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_28                                               (0x10000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_29                                               (0x20000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_30                                               (0x40000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_31                                               (0x80000000UL << FLASH_DATA1_DATA1_Pos)

/* =====================================================    DATA2    =====================================================*/
#define FLASH_DATA2_DATA2_Pos                                              (0UL)    /*!<FLASH DATA2: DATA2 (Bit 0) */
#define FLASH_DATA2_DATA2_Msk                                              (0xffffffffUL)   /*!< FLASH DATA2: DATA2 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA2_DATA2                                                  FLASH_DATA2_DATA2_Msk
#define FLASH_DATA2_DATA2_0                                                (0x1U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_1                                                (0x2U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_2                                                (0x4U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_3                                                (0x8U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_4                                                (0x10U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_5                                                (0x20U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_6                                                (0x40U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_7                                                (0x80U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_8                                                (0x100U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_9                                                (0x200U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_10                                               (0x400U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_11                                               (0x800U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_12                                               (0x1000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_13                                               (0x2000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_14                                               (0x4000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_15                                               (0x8000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_16                                               (0x10000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_17                                               (0x20000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_18                                               (0x40000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_19                                               (0x80000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_20                                               (0x100000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_21                                               (0x200000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_22                                               (0x400000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_23                                               (0x800000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_24                                               (0x1000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_25                                               (0x2000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_26                                               (0x4000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_27                                               (0x8000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_28                                               (0x10000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_29                                               (0x20000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_30                                               (0x40000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_31                                               (0x80000000UL << FLASH_DATA2_DATA2_Pos)

/* =====================================================    DATA3    =====================================================*/
#define FLASH_DATA3_DATA3_Pos                                              (0UL)    /*!<FLASH DATA3: DATA3 (Bit 0) */
#define FLASH_DATA3_DATA3_Msk                                              (0xffffffffUL)   /*!< FLASH DATA3: DATA3 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA3_DATA3                                                  FLASH_DATA3_DATA3_Msk
#define FLASH_DATA3_DATA3_0                                                (0x1U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_1                                                (0x2U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_2                                                (0x4U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_3                                                (0x8U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_4                                                (0x10U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_5                                                (0x20U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_6                                                (0x40U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_7                                                (0x80U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_8                                                (0x100U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_9                                                (0x200U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_10                                               (0x400U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_11                                               (0x800U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_12                                               (0x1000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_13                                               (0x2000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_14                                               (0x4000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_15                                               (0x8000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_16                                               (0x10000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_17                                               (0x20000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_18                                               (0x40000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_19                                               (0x80000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_20                                               (0x100000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_21                                               (0x200000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_22                                               (0x400000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_23                                               (0x800000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_24                                               (0x1000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_25                                               (0x2000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_26                                               (0x4000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_27                                               (0x8000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_28                                               (0x10000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_29                                               (0x20000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_30                                               (0x40000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_31                                               (0x80000000UL << FLASH_DATA3_DATA3_Pos)


/* =========================================================================================================================== */
/*=====================                                       SPI                                       ===================== */
/* =========================================================================================================================== */

