stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* ============================================================================================================================*/
/*=====================                                        RNG                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define RNG_CR_CLKDIV_15_0_Pos                                             (8UL)    /*!<RNG CR: CLKDIV_15_0 (Bit 8) */
#define RNG_CR_CLKDIV_15_0_Msk                                             (0xffff00UL)   /*!< RNG CR: CLKDIV_15_0 (Bitfield-Mask: 0xffff) */
#define RNG_CR_CLKDIV_15_0                                                 RNG_CR_CLKDIV_15_0_Msk
#define RNG_CR_CLKDIV_15_0_0                                               (0x1U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_1                                               (0x2U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_2                                               (0x4U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_3                                               (0x8U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_4                                               (0x10U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_5                                               (0x20U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_6                                               (0x40U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_7                                               (0x80U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_8                                               (0x100U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_9                                               (0x200U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_10                                              (0x400U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_11                                              (0x800U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_12                                              (0x1000U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_13                                              (0x2000U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_14                                              (0x4000U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_CLKDIV_15_0_15                                              (0x8000U << RNG_CR_CLKDIV_15_0_Pos)
#define RNG_CR_RST_HEALTH_FLAGS_Pos                                        (7UL)    /*!<RNG CR: RST_HEALTH_FLAGS (Bit 7) */
#define RNG_CR_RST_HEALTH_FLAGS_Msk                                        (0x80UL)   /*!< RNG CR: RST_HEALTH_FLAGS (Bitfield-Mask: 0x01) */
#define RNG_CR_RST_HEALTH_FLAGS                                            RNG_CR_RST_HEALTH_FLAGS_Msk
#define RNG_CR_CLR_REVCLK_FLAG_Pos                                         (6UL)    /*!<RNG CR: CLR_REVCLK_FLAG (Bit 6) */
#define RNG_CR_CLR_REVCLK_FLAG_Msk                                         (0x40UL)   /*!< RNG CR: CLR_REVCLK_FLAG (Bitfield-Mask: 0x01) */
#define RNG_CR_CLR_REVCLK_FLAG                                             RNG_CR_CLR_REVCLK_FLAG_Msk
#define RNG_CR_DISABLE_Pos                                                 (0UL)    /*!<RNG CR: DISABLE (Bit 0) */
#define RNG_CR_DISABLE_Msk                                                 (0x1UL)    /*!< RNG CR: DISABLE (Bitfield-Mask: 0x01) */
#define RNG_CR_DISABLE                                                     RNG_CR_DISABLE_Msk

/* =====================================================    SR    =====================================================*/
#define RNG_SR_OSCS_ADAPT_ERROR_Pos                                        (25UL)   /*!<RNG SR: OSCS_ADAPT_ERROR (Bit 25) */
#define RNG_SR_OSCS_ADAPT_ERROR_Msk                                        (0x2000000UL)    /*!< RNG SR: OSCS_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_SR_OSCS_ADAPT_ERROR                                            RNG_SR_OSCS_ADAPT_ERROR_Msk
#define RNG_SR_OSCS_REPET_ERROR_Pos                                        (24UL)   /*!<RNG SR: OSCS_REPET_ERROR (Bit 24) */
#define RNG_SR_OSCS_REPET_ERROR_Msk                                        (0x1000000UL)    /*!< RNG SR: OSCS_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_SR_OSCS_REPET_ERROR                                            RNG_SR_OSCS_REPET_ERROR_Msk
#define RNG_SR_OSCS_HEALTH_DONE_Pos                                        (23UL)   /*!<RNG SR: OSCS_HEALTH_DONE (Bit 23) */
#define RNG_SR_OSCS_HEALTH_DONE_Msk                                        (0x800000UL)   /*!< RNG SR: OSCS_HEALTH_DONE (Bitfield-Mask: 0x01) */
#define RNG_SR_OSCS_HEALTH_DONE                                            RNG_SR_OSCS_HEALTH_DONE_Msk
#define RNG_SR_ADAPT_ERROR_Pos                                             (22UL)   /*!<RNG SR: ADAPT_ERROR (Bit 22) */
#define RNG_SR_ADAPT_ERROR_Msk                                             (0x400000UL)   /*!< RNG SR: ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_SR_ADAPT_ERROR                                                 RNG_SR_ADAPT_ERROR_Msk
#define RNG_SR_REPET_ERROR_Pos                                             (21UL)   /*!<RNG SR: REPET_ERROR (Bit 21) */
#define RNG_SR_REPET_ERROR_Msk                                             (0x200000UL)   /*!< RNG SR: REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_SR_REPET_ERROR                                                 RNG_SR_REPET_ERROR_Msk
#define RNG_SR_SRC_HEALTH_DONE_Pos                                         (20UL)   /*!<RNG SR: SRC_HEALTH_DONE (Bit 20) */
#define RNG_SR_SRC_HEALTH_DONE_Msk                                         (0x100000UL)   /*!< RNG SR: SRC_HEALTH_DONE (Bitfield-Mask: 0x01) */
#define RNG_SR_SRC_HEALTH_DONE                                             RNG_SR_SRC_HEALTH_DONE_Msk
#define RNG_SR_FIFO_FULL_Pos                                               (5UL)    /*!<RNG SR: FIFO_FULL (Bit 5) */
#define RNG_SR_FIFO_FULL_Msk                                               (0x20UL)   /*!< RNG SR: FIFO_FULL (Bitfield-Mask: 0x01) */
#define RNG_SR_FIFO_FULL                                                   RNG_SR_FIFO_FULL_Msk
#define RNG_SR_VAL_READY_Pos                                               (4UL)    /*!<RNG SR: VAL_READY (Bit 4) */
#define RNG_SR_VAL_READY_Msk                                               (0x10UL)   /*!< RNG SR: VAL_READY (Bitfield-Mask: 0x01) */
#define RNG_SR_VAL_READY                                                   RNG_SR_VAL_READY_Msk
#define RNG_SR_ENTROPY_ERR_Pos                                             (3UL)    /*!<RNG SR: ENTROPY_ERR (Bit 3) */
#define RNG_SR_ENTROPY_ERR_Msk                                             (0x8UL)    /*!< RNG SR: ENTROPY_ERR (Bitfield-Mask: 0x01) */
#define RNG_SR_ENTROPY_ERR                                                 RNG_SR_ENTROPY_ERR_Msk
#define RNG_SR_REVEAL_CLK_ERR_Pos                                          (2UL)    /*!<RNG SR: REVEAL_CLK_ERR (Bit 2) */
#define RNG_SR_REVEAL_CLK_ERR_Msk                                          (0x4UL)    /*!< RNG SR: REVEAL_CLK_ERR (Bitfield-Mask: 0x01) */
#define RNG_SR_REVEAL_CLK_ERR                                              RNG_SR_REVEAL_CLK_ERR_Msk
#define RNG_SR_ALL_OSCS_DOWN_Pos                                           (1UL)    /*!<RNG SR: ALL_OSCS_DOWN (Bit 1) */
#define RNG_SR_ALL_OSCS_DOWN_Msk                                           (0x2UL)    /*!< RNG SR: ALL_OSCS_DOWN (Bitfield-Mask: 0x01) */
#define RNG_SR_ALL_OSCS_DOWN                                               RNG_SR_ALL_OSCS_DOWN_Msk
#define RNG_SR_DISABLED_Pos                                                (0UL)    /*!<RNG SR: DISABLED (Bit 0) */
#define RNG_SR_DISABLED_Msk                                                (0x1UL)    /*!< RNG SR: DISABLED (Bitfield-Mask: 0x01) */
#define RNG_SR_DISABLED                                                    RNG_SR_DISABLED_Msk

/* =====================================================    VAL    =====================================================*/
#define RNG_VAL_RND_VAL_Pos                                                (0UL)    /*!<RNG VAL: RND_VAL (Bit 0) */
#define RNG_VAL_RND_VAL_Msk                                                (0xffffffffUL)   /*!< RNG VAL: RND_VAL (Bitfield-Mask: 0xffffffff) */
#define RNG_VAL_RND_VAL                                                    RNG_VAL_RND_VAL_Msk
#define RNG_VAL_RND_VAL_0                                                  (0x1U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_1                                                  (0x2U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_2                                                  (0x4U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_3                                                  (0x8U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_4                                                  (0x10U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_5                                                  (0x20U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_6                                                  (0x40U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_7                                                  (0x80U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_8                                                  (0x100U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_9                                                  (0x200U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_10                                                 (0x400U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_11                                                 (0x800U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_12                                                 (0x1000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_13                                                 (0x2000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_14                                                 (0x4000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_15                                                 (0x8000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_16                                                 (0x10000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_17                                                 (0x20000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_18                                                 (0x40000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_19                                                 (0x80000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_20                                                 (0x100000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_21                                                 (0x200000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_22                                                 (0x400000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_23                                                 (0x800000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_24                                                 (0x1000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_25                                                 (0x2000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_26                                                 (0x4000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_27                                                 (0x8000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_28                                                 (0x10000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_29                                                 (0x20000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_30                                                 (0x40000000U << RNG_VAL_RND_VAL_Pos)
#define RNG_VAL_RND_VAL_31                                                 (0x80000000UL << RNG_VAL_RND_VAL_Pos)

/* =====================================================    OSCS_CR    =====================================================*/
#define RNG_OSCS_CR_SYNC_OSCS_Pos                                          (31UL)   /*!<RNG OSCS_CR: SYNC_OSCS (Bit 31) */
#define RNG_OSCS_CR_SYNC_OSCS_Msk                                          (0x80000000UL)   /*!< RNG OSCS_CR: SYNC_OSCS (Bitfield-Mask: 0x01) */
#define RNG_OSCS_CR_SYNC_OSCS                                              RNG_OSCS_CR_SYNC_OSCS_Msk
#define RNG_OSCS_CR_PWRD3_Pos                                              (7UL)    /*!<RNG OSCS_CR: PWRD3 (Bit 7) */
#define RNG_OSCS_CR_PWRD3_Msk                                              (0x380UL)    /*!< RNG OSCS_CR: PWRD3 (Bitfield-Mask: 0x07) */
#define RNG_OSCS_CR_PWRD3                                                  RNG_OSCS_CR_PWRD3_Msk
#define RNG_OSCS_CR_PWRD3_0                                                (0x1U << RNG_OSCS_CR_PWRD3_Pos)
#define RNG_OSCS_CR_PWRD3_1                                                (0x2U << RNG_OSCS_CR_PWRD3_Pos)
#define RNG_OSCS_CR_PWRD3_2                                                (0x4U << RNG_OSCS_CR_PWRD3_Pos)
#define RNG_OSCS_CR_PWRD2_Pos                                              (4UL)    /*!<RNG OSCS_CR: PWRD2 (Bit 4) */
#define RNG_OSCS_CR_PWRD2_Msk                                              (0x70UL)   /*!< RNG OSCS_CR: PWRD2 (Bitfield-Mask: 0x07) */
#define RNG_OSCS_CR_PWRD2                                                  RNG_OSCS_CR_PWRD2_Msk
#define RNG_OSCS_CR_PWRD2_0                                                (0x1U << RNG_OSCS_CR_PWRD2_Pos)
#define RNG_OSCS_CR_PWRD2_1                                                (0x2U << RNG_OSCS_CR_PWRD2_Pos)
#define RNG_OSCS_CR_PWRD2_2                                                (0x4U << RNG_OSCS_CR_PWRD2_Pos)
#define RNG_OSCS_CR_PWRD1_Pos                                              (1UL)    /*!<RNG OSCS_CR: PWRD1 (Bit 1) */
#define RNG_OSCS_CR_PWRD1_Msk                                              (0xeUL)    /*!< RNG OSCS_CR: PWRD1 (Bitfield-Mask: 0x07) */
#define RNG_OSCS_CR_PWRD1                                                  RNG_OSCS_CR_PWRD1_Msk
#define RNG_OSCS_CR_PWRD1_0                                                (0x1U << RNG_OSCS_CR_PWRD1_Pos)
#define RNG_OSCS_CR_PWRD1_1                                                (0x2U << RNG_OSCS_CR_PWRD1_Pos)
#define RNG_OSCS_CR_PWRD1_2                                                (0x4U << RNG_OSCS_CR_PWRD1_Pos)

