stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    DEFKEY3    =====================================================*/
#define RNG_DEFKEY3_RNG_DEFKEY3_Pos                                        (0UL)    /*!<RNG DEFKEY3: RNG_DEFKEY3 (Bit 0) */
#define RNG_DEFKEY3_RNG_DEFKEY3_Msk                                        (0xffffffffUL)   /*!< RNG DEFKEY3: RNG_DEFKEY3 (Bitfield-Mask: 0xffffffff) */
#define RNG_DEFKEY3_RNG_DEFKEY3                                            RNG_DEFKEY3_RNG_DEFKEY3_Msk
#define RNG_DEFKEY3_RNG_DEFKEY3_0                                          (0x1U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_1                                          (0x2U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_2                                          (0x4U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_3                                          (0x8U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_4                                          (0x10U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_5                                          (0x20U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_6                                          (0x40U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_7                                          (0x80U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_8                                          (0x100U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_9                                          (0x200U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_10                                         (0x400U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_11                                         (0x800U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_12                                         (0x1000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_13                                         (0x2000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_14                                         (0x4000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_15                                         (0x8000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_16                                         (0x10000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_17                                         (0x20000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_18                                         (0x40000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_19                                         (0x80000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_20                                         (0x100000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_21                                         (0x200000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_22                                         (0x400000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_23                                         (0x800000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_24                                         (0x1000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_25                                         (0x2000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_26                                         (0x4000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_27                                         (0x8000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_28                                         (0x10000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_29                                         (0x20000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_30                                         (0x40000000U << RNG_DEFKEY3_RNG_DEFKEY3_Pos)
#define RNG_DEFKEY3_RNG_DEFKEY3_31                                         (0x80000000UL << RNG_DEFKEY3_RNG_DEFKEY3_Pos)

/* =====================================================    HEALTH_CR    =====================================================*/
#define RNG_HEALTH_CR_ITER_ADAP_Pos                                        (28UL)   /*!<RNG HEALTH_CR: ITER_ADAP (Bit 28) */
#define RNG_HEALTH_CR_ITER_ADAP_Msk                                        (0x30000000UL)   /*!< RNG HEALTH_CR: ITER_ADAP (Bitfield-Mask: 0x03) */
#define RNG_HEALTH_CR_ITER_ADAP                                            RNG_HEALTH_CR_ITER_ADAP_Msk
#define RNG_HEALTH_CR_ITER_ADAP_0                                          (0x1U << RNG_HEALTH_CR_ITER_ADAP_Pos)
#define RNG_HEALTH_CR_ITER_ADAP_1                                          (0x2U << RNG_HEALTH_CR_ITER_ADAP_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_Pos                                      (16UL)   /*!<RNG HEALTH_CR: ADAP_CUTOFF (Bit 16) */
#define RNG_HEALTH_CR_ADAP_CUTOFF_Msk                                      (0x3ff0000UL)    /*!< RNG HEALTH_CR: ADAP_CUTOFF (Bitfield-Mask: 0x3ff) */
#define RNG_HEALTH_CR_ADAP_CUTOFF                                          RNG_HEALTH_CR_ADAP_CUTOFF_Msk
#define RNG_HEALTH_CR_ADAP_CUTOFF_0                                        (0x1U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_1                                        (0x2U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_2                                        (0x4U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_3                                        (0x8U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_4                                        (0x10U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_5                                        (0x20U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_6                                        (0x40U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_7                                        (0x80U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_8                                        (0x100U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_ADAP_CUTOFF_9                                        (0x200U << RNG_HEALTH_CR_ADAP_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_Pos                                     (0UL)    /*!<RNG HEALTH_CR: REPET_CUTOFF (Bit 0) */
#define RNG_HEALTH_CR_REPET_CUTOFF_Msk                                     (0xffUL)   /*!< RNG HEALTH_CR: REPET_CUTOFF (Bitfield-Mask: 0xff) */
#define RNG_HEALTH_CR_REPET_CUTOFF                                         RNG_HEALTH_CR_REPET_CUTOFF_Msk
#define RNG_HEALTH_CR_REPET_CUTOFF_0                                       (0x1U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_1                                       (0x2U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_2                                       (0x4U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_3                                       (0x8U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_4                                       (0x10U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_5                                       (0x20U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_6                                       (0x40U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)
#define RNG_HEALTH_CR_REPET_CUTOFF_7                                       (0x80U << RNG_HEALTH_CR_REPET_CUTOFF_Pos)

/* =====================================================    HEALTH_OSC1_CR    =====================================================*/
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos                            (16UL)   /*!<RNG HEALTH_OSC1_CR: ADAP_CUTOFF_OSC1 (Bit 16) */
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Msk                            (0x3ff0000UL)    /*!< RNG HEALTH_OSC1_CR: ADAP_CUTOFF_OSC1 (Bitfield-Mask: 0x3ff) */
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1                                RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Msk
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_0                              (0x1U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_1                              (0x2U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_2                              (0x4U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_3                              (0x8U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_4                              (0x10U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_5                              (0x20U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_6                              (0x40U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_7                              (0x80U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_8                              (0x100U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_9                              (0x200U << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos                           (0UL)    /*!<RNG HEALTH_OSC1_CR: REPET_CUTOFF_OSC1 (Bit 0) */
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Msk                           (0xffUL)   /*!< RNG HEALTH_OSC1_CR: REPET_CUTOFF_OSC1 (Bitfield-Mask: 0xff) */
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1                               RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Msk
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_0                             (0x1U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_1                             (0x2U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_2                             (0x4U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_3                             (0x8U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_4                             (0x10U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_5                             (0x20U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_6                             (0x40U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)
#define RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_7                             (0x80U << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos)

/* =====================================================    HEALTH_OSC2_CR    =====================================================*/
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos                            (16UL)   /*!<RNG HEALTH_OSC2_CR: ADAP_CUTOFF_OSC2 (Bit 16) */
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Msk                            (0x3ff0000UL)    /*!< RNG HEALTH_OSC2_CR: ADAP_CUTOFF_OSC2 (Bitfield-Mask: 0x3ff) */
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2                                RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Msk
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_0                              (0x1U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_1                              (0x2U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_2                              (0x4U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_3                              (0x8U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_4                              (0x10U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_5                              (0x20U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_6                              (0x40U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_7                              (0x80U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_8                              (0x100U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_9                              (0x200U << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos                           (0UL)    /*!<RNG HEALTH_OSC2_CR: REPET_CUTOFF_OSC2 (Bit 0) */
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Msk                           (0xffUL)   /*!< RNG HEALTH_OSC2_CR: REPET_CUTOFF_OSC2 (Bitfield-Mask: 0xff) */
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2                               RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Msk
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_0                             (0x1U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_1                             (0x2U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_2                             (0x4U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_3                             (0x8U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_4                             (0x10U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_5                             (0x20U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_6                             (0x40U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)
#define RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_7                             (0x80U << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos)

/* =====================================================    HEALTH_OSC3_CR    =====================================================*/
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos                            (16UL)   /*!<RNG HEALTH_OSC3_CR: ADAP_CUTOFF_OSC3 (Bit 16) */
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Msk                            (0x3ff0000UL)    /*!< RNG HEALTH_OSC3_CR: ADAP_CUTOFF_OSC3 (Bitfield-Mask: 0x3ff) */
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3                                RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Msk
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_0                              (0x1U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_1                              (0x2U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_2                              (0x4U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_3                              (0x8U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_4                              (0x10U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_5                              (0x20U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_6                              (0x40U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_7                              (0x80U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_8                              (0x100U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_9                              (0x200U << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos                           (0UL)    /*!<RNG HEALTH_OSC3_CR: REPET_CUTOFF_OSC3 (Bit 0) */
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Msk                           (0xffUL)   /*!< RNG HEALTH_OSC3_CR: REPET_CUTOFF_OSC3 (Bitfield-Mask: 0xff) */
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3                               RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Msk
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_0                             (0x1U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_1                             (0x2U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_2                             (0x4U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_3                             (0x8U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_4                             (0x10U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_5                             (0x20U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_6                             (0x40U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)
#define RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_7                             (0x80U << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos)

/* =====================================================    HEALTH_OSC1_SR    =====================================================*/
#define RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_Pos                             (5UL)    /*!<RNG HEALTH_OSC1_SR: TO3_ADAPT_ERROR (Bit 5) */
#define RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_Msk                             (0x20UL)   /*!< RNG HEALTH_OSC1_SR: TO3_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR                                 RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_Pos                             (4UL)    /*!<RNG HEALTH_OSC1_SR: TO3_REPET_ERROR (Bit 4) */
#define RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_Msk                             (0x10UL)   /*!< RNG HEALTH_OSC1_SR: TO3_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR                                 RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_Msk
#define RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_Pos                             (3UL)    /*!<RNG HEALTH_OSC1_SR: TO2_ADAPT_ERROR (Bit 3) */
#define RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_Msk                             (0x8UL)    /*!< RNG HEALTH_OSC1_SR: TO2_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR                                 RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_Pos                             (2UL)    /*!<RNG HEALTH_OSC1_SR: TO2_REPET_ERROR (Bit 2) */
#define RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_Msk                             (0x4UL)    /*!< RNG HEALTH_OSC1_SR: TO2_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR                                 RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_Msk
#define RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_Pos                             (1UL)    /*!<RNG HEALTH_OSC1_SR: TO1_ADAPT_ERROR (Bit 1) */
#define RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_Msk                             (0x2UL)    /*!< RNG HEALTH_OSC1_SR: TO1_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR                                 RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_Pos                             (0UL)    /*!<RNG HEALTH_OSC1_SR: TO1_REPET_ERROR (Bit 0) */
#define RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_Msk                             (0x1UL)    /*!< RNG HEALTH_OSC1_SR: TO1_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR                                 RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_Msk

/* =====================================================    HEALTH_OSC2_SR    =====================================================*/
#define RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_Pos                             (5UL)    /*!<RNG HEALTH_OSC2_SR: TO3_ADAPT_ERROR (Bit 5) */
#define RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_Msk                             (0x20UL)   /*!< RNG HEALTH_OSC2_SR: TO3_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR                                 RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_Pos                             (4UL)    /*!<RNG HEALTH_OSC2_SR: TO3_REPET_ERROR (Bit 4) */
#define RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_Msk                             (0x10UL)   /*!< RNG HEALTH_OSC2_SR: TO3_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR                                 RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_Msk
#define RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_Pos                             (3UL)    /*!<RNG HEALTH_OSC2_SR: TO2_ADAPT_ERROR (Bit 3) */
#define RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_Msk                             (0x8UL)    /*!< RNG HEALTH_OSC2_SR: TO2_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR                                 RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_Pos                             (2UL)    /*!<RNG HEALTH_OSC2_SR: TO2_REPET_ERROR (Bit 2) */
#define RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_Msk                             (0x4UL)    /*!< RNG HEALTH_OSC2_SR: TO2_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR                                 RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_Msk
#define RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_Pos                             (1UL)    /*!<RNG HEALTH_OSC2_SR: TO1_ADAPT_ERROR (Bit 1) */
#define RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_Msk                             (0x2UL)    /*!< RNG HEALTH_OSC2_SR: TO1_ADAPT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR                                 RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_Msk
#define RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_Pos                             (0UL)    /*!<RNG HEALTH_OSC2_SR: TO1_REPET_ERROR (Bit 0) */
#define RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_Msk                             (0x1UL)    /*!< RNG HEALTH_OSC2_SR: TO1_REPET_ERROR (Bitfield-Mask: 0x01) */
#define RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR                                 RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_Msk

