stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    RDR    ===================================================== */
#define USART_RDR_RDR_Pos                                                  (0UL)    /*!<USART RDR: RDR (Bit 0) */
#define USART_RDR_RDR_Msk                                                  (0x1ffUL)    /*!< USART RDR: RDR (Bitfield-Mask: 0x1ff) */
#define USART_RDR_RDR                                                      USART_RDR_RDR_Msk
#define USART_RDR_RDR_0                                                    (0x1U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_1                                                    (0x2U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_2                                                    (0x4U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_3                                                    (0x8U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_4                                                    (0x10U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_5                                                    (0x20U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_6                                                    (0x40U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_7                                                    (0x80U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_8                                                    (0x100U << USART_RDR_RDR_Pos)

/* =====================================================    TDR    ===================================================== */
#define USART_TDR_TDR_Pos                                                  (0UL)    /*!<USART TDR: TDR (Bit 0) */
#define USART_TDR_TDR_Msk                                                  (0x1ffUL)    /*!< USART TDR: TDR (Bitfield-Mask: 0x1ff) */
#define USART_TDR_TDR                                                      USART_TDR_TDR_Msk
#define USART_TDR_TDR_0                                                    (0x1U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_1                                                    (0x2U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_2                                                    (0x4U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_3                                                    (0x8U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_4                                                    (0x10U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_5                                                    (0x20U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_6                                                    (0x40U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_7                                                    (0x80U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_8                                                    (0x100U << USART_TDR_TDR_Pos)

/* =====================================================    PRESC    ===================================================== */
#define USART_PRESC_PRESCALER_Pos                                          (0UL)    /*!<USART PRESC: PRESCALER (Bit 0) */
#define USART_PRESC_PRESCALER_Msk                                          (0xfUL)    /*!< USART PRESC: PRESCALER (Bitfield-Mask: 0x0f) */
#define USART_PRESC_PRESCALER                                              USART_PRESC_PRESCALER_Msk
#define USART_PRESC_PRESCALER_0                                            (0x1U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_1                                            (0x2U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_2                                            (0x4U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_3                                            (0x8U << USART_PRESC_PRESCALER_Pos)


/* =========================================================================================================================== */
/*=====================                                       RTC                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    TR    ===================================================== */
#define RTC_TR_PM_Pos                                                      (22UL)   /*!<RTC TR: PM (Bit 22) */
#define RTC_TR_PM_Msk                                                      (0x400000UL)   /*!< RTC TR: PM (Bitfield-Mask: 0x01) */
#define RTC_TR_PM                                                          RTC_TR_PM_Msk
#define RTC_TR_HT_Pos                                                      (20UL)   /*!<RTC TR: HT (Bit 20) */
#define RTC_TR_HT_Msk                                                      (0x300000UL)   /*!< RTC TR: HT (Bitfield-Mask: 0x03) */
#define RTC_TR_HT                                                          RTC_TR_HT_Msk
#define RTC_TR_HT_0                                                        (0x1U << RTC_TR_HT_Pos)
#define RTC_TR_HT_1                                                        (0x2U << RTC_TR_HT_Pos)
#define RTC_TR_HU_Pos                                                      (16UL)   /*!<RTC TR: HU (Bit 16) */
#define RTC_TR_HU_Msk                                                      (0xf0000UL)    /*!< RTC TR: HU (Bitfield-Mask: 0x0f) */
#define RTC_TR_HU                                                          RTC_TR_HU_Msk
#define RTC_TR_HU_0                                                        (0x1U << RTC_TR_HU_Pos)
#define RTC_TR_HU_1                                                        (0x2U << RTC_TR_HU_Pos)
#define RTC_TR_HU_2                                                        (0x4U << RTC_TR_HU_Pos)
#define RTC_TR_HU_3                                                        (0x8U << RTC_TR_HU_Pos)
#define RTC_TR_MNT_Pos                                                     (12UL)   /*!<RTC TR: MNT (Bit 12) */
#define RTC_TR_MNT_Msk                                                     (0x7000UL)   /*!< RTC TR: MNT (Bitfield-Mask: 0x07) */
#define RTC_TR_MNT                                                         RTC_TR_MNT_Msk
#define RTC_TR_MNT_0                                                       (0x1U << RTC_TR_MNT_Pos)
#define RTC_TR_MNT_1                                                       (0x2U << RTC_TR_MNT_Pos)
#define RTC_TR_MNT_2                                                       (0x4U << RTC_TR_MNT_Pos)
#define RTC_TR_MNU_Pos                                                     (8UL)    /*!<RTC TR: MNU (Bit 8) */
#define RTC_TR_MNU_Msk                                                     (0xf00UL)    /*!< RTC TR: MNU (Bitfield-Mask: 0x0f) */
#define RTC_TR_MNU                                                         RTC_TR_MNU_Msk
#define RTC_TR_MNU_0                                                       (0x1U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_1                                                       (0x2U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_2                                                       (0x4U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_3                                                       (0x8U << RTC_TR_MNU_Pos)
#define RTC_TR_ST_Pos                                                      (4UL)    /*!<RTC TR: ST (Bit 4) */
#define RTC_TR_ST_Msk                                                      (0x70UL)   /*!< RTC TR: ST (Bitfield-Mask: 0x07) */
#define RTC_TR_ST                                                          RTC_TR_ST_Msk
#define RTC_TR_ST_0                                                        (0x1U << RTC_TR_ST_Pos)
#define RTC_TR_ST_1                                                        (0x2U << RTC_TR_ST_Pos)
#define RTC_TR_ST_2                                                        (0x4U << RTC_TR_ST_Pos)
#define RTC_TR_SU_Pos                                                      (0UL)    /*!<RTC TR: SU (Bit 0) */
#define RTC_TR_SU_Msk                                                      (0xfUL)    /*!< RTC TR: SU (Bitfield-Mask: 0x0f) */
#define RTC_TR_SU                                                          RTC_TR_SU_Msk
#define RTC_TR_SU_0                                                        (0x1U << RTC_TR_SU_Pos)
#define RTC_TR_SU_1                                                        (0x2U << RTC_TR_SU_Pos)
#define RTC_TR_SU_2                                                        (0x4U << RTC_TR_SU_Pos)
#define RTC_TR_SU_3                                                        (0x8U << RTC_TR_SU_Pos)

