stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/******************** Number of backup registers ******************************/
#define RTC_BKP_NUMBER                 (2U)

/* ============================================================================================================================*/
/*=====================                                        PKA                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define PKA_CR_FAULTERRORCODEIE_Pos                                        (23UL)   /*!<PKA CR: FAULTERRORCODEIE (Bit 23) */
#define PKA_CR_FAULTERRORCODEIE_Msk                                        (0x800000UL)   /*!< PKA CR: FAULTERRORCODEIE (Bitfield-Mask: 0x01) */
#define PKA_CR_FAULTERRORCODEIE                                            PKA_CR_FAULTERRORCODEIE_Msk
#define PKA_CR_FAULTFSMIE_Pos                                              (22UL)   /*!<PKA CR: FAULTFSMIE (Bit 22) */
#define PKA_CR_FAULTFSMIE_Msk                                              (0x400000UL)   /*!< PKA CR: FAULTFSMIE (Bitfield-Mask: 0x01) */
#define PKA_CR_FAULTFSMIE                                                  PKA_CR_FAULTFSMIE_Msk
#define PKA_CR_ADDRERRIE_Pos                                               (20UL)   /*!<PKA CR: ADDRERRIE (Bit 20) */
#define PKA_CR_ADDRERRIE_Msk                                               (0x100000UL)   /*!< PKA CR: ADDRERRIE (Bitfield-Mask: 0x01) */
#define PKA_CR_ADDRERRIE                                                   PKA_CR_ADDRERRIE_Msk
#define PKA_CR_RAMERRIE_Pos                                                (19UL)   /*!<PKA CR: RAMERRIE (Bit 19) */
#define PKA_CR_RAMERRIE_Msk                                                (0x80000UL)    /*!< PKA CR: RAMERRIE (Bitfield-Mask: 0x01) */
#define PKA_CR_RAMERRIE                                                    PKA_CR_RAMERRIE_Msk
#define PKA_CR_PROCENDIE_Pos                                               (17UL)   /*!<PKA CR: PROCENDIE (Bit 17) */
#define PKA_CR_PROCENDIE_Msk                                               (0x20000UL)    /*!< PKA CR: PROCENDIE (Bitfield-Mask: 0x01) */
#define PKA_CR_PROCENDIE                                                   PKA_CR_PROCENDIE_Msk
#define PKA_CR_MODE_Pos                                                    (8UL)    /*!<PKA CR: MODE (Bit 8) */
#define PKA_CR_MODE_Msk                                                    (0x3f00UL)   /*!< PKA CR: MODE (Bitfield-Mask: 0x3f) */
#define PKA_CR_MODE                                                        PKA_CR_MODE_Msk
#define PKA_CR_MODE_0                                                      (0x1U << PKA_CR_MODE_Pos)
#define PKA_CR_MODE_1                                                      (0x2U << PKA_CR_MODE_Pos)
#define PKA_CR_MODE_2                                                      (0x4U << PKA_CR_MODE_Pos)
#define PKA_CR_MODE_3                                                      (0x8U << PKA_CR_MODE_Pos)
#define PKA_CR_MODE_4                                                      (0x10U << PKA_CR_MODE_Pos)
#define PKA_CR_MODE_5                                                      (0x20U << PKA_CR_MODE_Pos)
#define PKA_CR_SECLVL_Pos                                                  (2UL)    /*!<PKA CR: SECLVL (Bit 2) */
#define PKA_CR_SECLVL_Msk                                                  (0x4UL)    /*!< PKA CR: SECLVL (Bitfield-Mask: 0x01) */
#define PKA_CR_SECLVL                                                      PKA_CR_SECLVL_Msk
#define PKA_CR_START_Pos                                                   (1UL)    /*!<PKA CR: START (Bit 1) */
#define PKA_CR_START_Msk                                                   (0x2UL)    /*!< PKA CR: START (Bitfield-Mask: 0x01) */
#define PKA_CR_START                                                       PKA_CR_START_Msk
#define PKA_CR_EN_Pos                                                      (0UL)    /*!<PKA CR: EN (Bit 0) */
#define PKA_CR_EN_Msk                                                      (0x1UL)    /*!< PKA CR: EN (Bitfield-Mask: 0x01) */
#define PKA_CR_EN                                                          PKA_CR_EN_Msk

/* =====================================================    SR    =====================================================*/
#define PKA_SR_FAULTERRORCODEF_Pos                                         (23UL)   /*!<PKA SR: FAULTERRORCODEF (Bit 23) */
#define PKA_SR_FAULTERRORCODEF_Msk                                         (0x800000UL)   /*!< PKA SR: FAULTERRORCODEF (Bitfield-Mask: 0x01) */
#define PKA_SR_FAULTERRORCODEF                                             PKA_SR_FAULTERRORCODEF_Msk
#define PKA_SR_FAULTFSMF_Pos                                               (22UL)   /*!<PKA SR: FAULTFSMF (Bit 22) */
#define PKA_SR_FAULTFSMF_Msk                                               (0x400000UL)   /*!< PKA SR: FAULTFSMF (Bitfield-Mask: 0x01) */
#define PKA_SR_FAULTFSMF                                                   PKA_SR_FAULTFSMF_Msk
#define PKA_SR_ADDRERRF_Pos                                                (20UL)   /*!<PKA SR: ADDRERRF (Bit 20) */
#define PKA_SR_ADDRERRF_Msk                                                (0x100000UL)   /*!< PKA SR: ADDRERRF (Bitfield-Mask: 0x01) */
#define PKA_SR_ADDRERRF                                                    PKA_SR_ADDRERRF_Msk
#define PKA_SR_RAMERRF_Pos                                                 (19UL)   /*!<PKA SR: RAMERRF (Bit 19) */
#define PKA_SR_RAMERRF_Msk                                                 (0x80000UL)    /*!< PKA SR: RAMERRF (Bitfield-Mask: 0x01) */
#define PKA_SR_RAMERRF                                                     PKA_SR_RAMERRF_Msk
#define PKA_SR_PROCENDF_Pos                                                (17UL)   /*!<PKA SR: PROCENDF (Bit 17) */
#define PKA_SR_PROCENDF_Msk                                                (0x20000UL)    /*!< PKA SR: PROCENDF (Bitfield-Mask: 0x01) */
#define PKA_SR_PROCENDF                                                    PKA_SR_PROCENDF_Msk
#define PKA_SR_BUSY_Pos                                                    (16UL)   /*!<PKA SR: BUSY (Bit 16) */
#define PKA_SR_BUSY_Msk                                                    (0x10000UL)    /*!< PKA SR: BUSY (Bitfield-Mask: 0x01) */
#define PKA_SR_BUSY                                                        PKA_SR_BUSY_Msk

/* =====================================================    CLRFR    =====================================================*/
#define PKA_CLRFR_FAULTERRORCODEFC_Pos                                     (23UL)   /*!<PKA CLRFR: FAULTERRORCODEFC (Bit 23) */
#define PKA_CLRFR_FAULTERRORCODEFC_Msk                                     (0x800000UL)   /*!< PKA CLRFR: FAULTERRORCODEFC (Bitfield-Mask: 0x01) */
#define PKA_CLRFR_FAULTERRORCODEFC                                         PKA_CLRFR_FAULTERRORCODEFC_Msk
#define PKA_CLRFR_FAULTFSMFC_Pos                                           (22UL)   /*!<PKA CLRFR: FAULTFSMFC (Bit 22) */
#define PKA_CLRFR_FAULTFSMFC_Msk                                           (0x400000UL)   /*!< PKA CLRFR: FAULTFSMFC (Bitfield-Mask: 0x01) */
#define PKA_CLRFR_FAULTFSMFC                                               PKA_CLRFR_FAULTFSMFC_Msk
#define PKA_CLRFR_ADDRERRFC_Pos                                            (20UL)   /*!<PKA CLRFR: ADDRERRFC (Bit 20) */
#define PKA_CLRFR_ADDRERRFC_Msk                                            (0x100000UL)   /*!< PKA CLRFR: ADDRERRFC (Bitfield-Mask: 0x01) */
#define PKA_CLRFR_ADDRERRFC                                                PKA_CLRFR_ADDRERRFC_Msk
#define PKA_CLRFR_RAMERRFC_Pos                                             (19UL)   /*!<PKA CLRFR: RAMERRFC (Bit 19) */
#define PKA_CLRFR_RAMERRFC_Msk                                             (0x80000UL)    /*!< PKA CLRFR: RAMERRFC (Bitfield-Mask: 0x01) */
#define PKA_CLRFR_RAMERRFC                                                 PKA_CLRFR_RAMERRFC_Msk
#define PKA_CLRFR_PROCENDFC_Pos                                            (17UL)   /*!<PKA CLRFR: PROCENDFC (Bit 17) */
#define PKA_CLRFR_PROCENDFC_Msk                                            (0x20000UL)    /*!< PKA CLRFR: PROCENDFC (Bitfield-Mask: 0x01) */
#define PKA_CLRFR_PROCENDFC                                                PKA_CLRFR_PROCENDFC_Msk

