stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    COMP_1    ===================================================== */
#define ADC_COMP_1_OFFSET1_Pos                                             (12UL)   /*!<ADC COMP_1: OFFSET1 (Bit 12) */
#define ADC_COMP_1_OFFSET1_Msk                                             (0xff000UL)    /*!< ADC COMP_1: OFFSET1 (Bitfield-Mask: 0xff) */
#define ADC_COMP_1_OFFSET1                                                 ADC_COMP_1_OFFSET1_Msk
#define ADC_COMP_1_OFFSET1_0                                               (0x1U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_1                                               (0x2U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_2                                               (0x4U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_3                                               (0x8U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_4                                               (0x10U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_5                                               (0x20U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_6                                               (0x40U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_7                                               (0x80U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_GAIN1_Pos                                               (0UL)    /*!<ADC COMP_1: GAIN1 (Bit 0) */
#define ADC_COMP_1_GAIN1_Msk                                               (0xfffUL)    /*!< ADC COMP_1: GAIN1 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_1_GAIN1                                                   ADC_COMP_1_GAIN1_Msk
#define ADC_COMP_1_GAIN1_0                                                 (0x1U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_1                                                 (0x2U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_2                                                 (0x4U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_3                                                 (0x8U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_4                                                 (0x10U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_5                                                 (0x20U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_6                                                 (0x40U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_7                                                 (0x80U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_8                                                 (0x100U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_9                                                 (0x200U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_10                                                (0x400U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_11                                                (0x800U << ADC_COMP_1_GAIN1_Pos)

/* =====================================================    COMP_2    ===================================================== */
#define ADC_COMP_2_OFFSET2_Pos                                             (12UL)   /*!<ADC COMP_2: OFFSET2 (Bit 12) */
#define ADC_COMP_2_OFFSET2_Msk                                             (0xff000UL)    /*!< ADC COMP_2: OFFSET2 (Bitfield-Mask: 0xff) */
#define ADC_COMP_2_OFFSET2                                                 ADC_COMP_2_OFFSET2_Msk
#define ADC_COMP_2_OFFSET2_0                                               (0x1U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_1                                               (0x2U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_2                                               (0x4U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_3                                               (0x8U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_4                                               (0x10U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_5                                               (0x20U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_6                                               (0x40U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_OFFSET2_7                                               (0x80U << ADC_COMP_2_OFFSET2_Pos)
#define ADC_COMP_2_GAIN2_Pos                                               (0UL)    /*!<ADC COMP_2: GAIN2 (Bit 0) */
#define ADC_COMP_2_GAIN2_Msk                                               (0xfffUL)    /*!< ADC COMP_2: GAIN2 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_2_GAIN2                                                   ADC_COMP_2_GAIN2_Msk
#define ADC_COMP_2_GAIN2_0                                                 (0x1U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_1                                                 (0x2U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_2                                                 (0x4U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_3                                                 (0x8U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_4                                                 (0x10U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_5                                                 (0x20U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_6                                                 (0x40U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_7                                                 (0x80U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_8                                                 (0x100U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_9                                                 (0x200U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_10                                                (0x400U << ADC_COMP_2_GAIN2_Pos)
#define ADC_COMP_2_GAIN2_11                                                (0x800U << ADC_COMP_2_GAIN2_Pos)

/* =====================================================    COMP_3    ===================================================== */
#define ADC_COMP_3_OFFSET3_Pos                                             (12UL)   /*!<ADC COMP_3: OFFSET3 (Bit 12) */
#define ADC_COMP_3_OFFSET3_Msk                                             (0xff000UL)    /*!< ADC COMP_3: OFFSET3 (Bitfield-Mask: 0xff) */
#define ADC_COMP_3_OFFSET3                                                 ADC_COMP_3_OFFSET3_Msk
#define ADC_COMP_3_OFFSET3_0                                               (0x1U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_1                                               (0x2U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_2                                               (0x4U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_3                                               (0x8U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_4                                               (0x10U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_5                                               (0x20U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_6                                               (0x40U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_OFFSET3_7                                               (0x80U << ADC_COMP_3_OFFSET3_Pos)
#define ADC_COMP_3_GAIN3_Pos                                               (0UL)    /*!<ADC COMP_3: GAIN3 (Bit 0) */
#define ADC_COMP_3_GAIN3_Msk                                               (0xfffUL)    /*!< ADC COMP_3: GAIN3 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_3_GAIN3                                                   ADC_COMP_3_GAIN3_Msk
#define ADC_COMP_3_GAIN3_0                                                 (0x1U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_1                                                 (0x2U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_2                                                 (0x4U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_3                                                 (0x8U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_4                                                 (0x10U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_5                                                 (0x20U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_6                                                 (0x40U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_7                                                 (0x80U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_8                                                 (0x100U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_9                                                 (0x200U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_10                                                (0x400U << ADC_COMP_3_GAIN3_Pos)
#define ADC_COMP_3_GAIN3_11                                                (0x800U << ADC_COMP_3_GAIN3_Pos)

/* =====================================================    COMP_4    ===================================================== */
#define ADC_COMP_4_OFFSET4_Pos                                             (12UL)   /*!<ADC COMP_4: OFFSET4 (Bit 12) */
#define ADC_COMP_4_OFFSET4_Msk                                             (0xff000UL)    /*!< ADC COMP_4: OFFSET4 (Bitfield-Mask: 0xff) */
#define ADC_COMP_4_OFFSET4                                                 ADC_COMP_4_OFFSET4_Msk
#define ADC_COMP_4_OFFSET4_0                                               (0x1U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_1                                               (0x2U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_2                                               (0x4U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_3                                               (0x8U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_4                                               (0x10U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_5                                               (0x20U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_6                                               (0x40U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_7                                               (0x80U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_GAIN4_Pos                                               (0UL)    /*!<ADC COMP_4: GAIN4 (Bit 0) */
#define ADC_COMP_4_GAIN4_Msk                                               (0xfffUL)    /*!< ADC COMP_4: GAIN4 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_4_GAIN4                                                   ADC_COMP_4_GAIN4_Msk
#define ADC_COMP_4_GAIN4_0                                                 (0x1U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_1                                                 (0x2U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_2                                                 (0x4U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_3                                                 (0x8U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_4                                                 (0x10U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_5                                                 (0x20U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_6                                                 (0x40U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_7                                                 (0x80U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_8                                                 (0x100U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_9                                                 (0x200U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_10                                                (0x400U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_11                                                (0x800U << ADC_COMP_4_GAIN4_Pos)

