stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    TIMEOUTREG    =====================================================*/
#define BLUE_TIMEOUTREG_TIMEOUT_Pos                                        (0UL)    /*!<BLUE TIMEOUTREG: TIMEOUT (Bit 0) */
#define BLUE_TIMEOUTREG_TIMEOUT_Msk                                        (0xffffffffUL)   /*!< BLUE TIMEOUTREG: TIMEOUT (Bitfield-Mask: 0xffffffff) */
#define BLUE_TIMEOUTREG_TIMEOUT                                            BLUE_TIMEOUTREG_TIMEOUT_Msk
#define BLUE_TIMEOUTREG_TIMEOUT_0                                          (0x1U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_1                                          (0x2U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_2                                          (0x4U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_3                                          (0x8U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_4                                          (0x10U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_5                                          (0x20U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_6                                          (0x40U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_7                                          (0x80U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_8                                          (0x100U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_9                                          (0x200U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_10                                         (0x400U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_11                                         (0x800U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_12                                         (0x1000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_13                                         (0x2000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_14                                         (0x4000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_15                                         (0x8000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_16                                         (0x10000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_17                                         (0x20000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_18                                         (0x40000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_19                                         (0x80000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_20                                         (0x100000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_21                                         (0x200000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_22                                         (0x400000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_23                                         (0x800000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_24                                         (0x1000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_25                                         (0x2000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_26                                         (0x4000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_27                                         (0x8000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_28                                         (0x10000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_29                                         (0x20000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_30                                         (0x40000000U << BLUE_TIMEOUTREG_TIMEOUT_Pos)
#define BLUE_TIMEOUTREG_TIMEOUT_31                                         (0x80000000UL << BLUE_TIMEOUTREG_TIMEOUT_Pos)

/* =====================================================    TIMERCAPTUREREG    =====================================================*/
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos                              (0UL)    /*!<BLUE TIMERCAPTUREREG: TIMERCAPTURE (Bit 0) */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Msk                              (0xffffffffUL)   /*!< BLUE TIMERCAPTUREREG: TIMERCAPTURE (Bitfield-Mask: 0xffffffff) */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE                                  BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Msk
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_0                                (0x1U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_1                                (0x2U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_2                                (0x4U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_3                                (0x8U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_4                                (0x10U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_5                                (0x20U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_6                                (0x40U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_7                                (0x80U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_8                                (0x100U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_9                                (0x200U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_10                               (0x400U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_11                               (0x800U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_12                               (0x1000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_13                               (0x2000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_14                               (0x4000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_15                               (0x8000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_16                               (0x10000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_17                               (0x20000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_18                               (0x40000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_19                               (0x80000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_20                               (0x100000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_21                               (0x200000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_22                               (0x400000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_23                               (0x800000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_24                               (0x1000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_25                               (0x2000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_26                               (0x4000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_27                               (0x8000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_28                               (0x10000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_29                               (0x20000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_30                               (0x40000000U << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_31                               (0x80000000UL << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)

/* =====================================================    CMDREG    =====================================================*/
#define BLUE_CMDREG_CLEARSEMAREQ_Pos                                       (3UL)    /*!<BLUE CMDREG: CLEARSEMAREQ (Bit 3) */
#define BLUE_CMDREG_CLEARSEMAREQ_Msk                                       (0x8UL)    /*!< BLUE CMDREG: CLEARSEMAREQ (Bitfield-Mask: 0x01) */
#define BLUE_CMDREG_CLEARSEMAREQ                                           BLUE_CMDREG_CLEARSEMAREQ_Msk
#define BLUE_CMDREG_TXRXSKIP_Pos                                           (0UL)    /*!<BLUE CMDREG: TXRXSKIP (Bit 0) */
#define BLUE_CMDREG_TXRXSKIP_Msk                                           (0x1UL)    /*!< BLUE CMDREG: TXRXSKIP (Bitfield-Mask: 0x01) */
#define BLUE_CMDREG_TXRXSKIP                                               BLUE_CMDREG_TXRXSKIP_Msk

/* =====================================================    STATUSREG    =====================================================*/
#define BLUE_STATUSREG_RCVOK_Pos                                           (31UL)   /*!<BLUE STATUSREG: RCVOK (Bit 31) */
#define BLUE_STATUSREG_RCVOK_Msk                                           (0x80000000UL)   /*!< BLUE STATUSREG: RCVOK (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVOK                                               BLUE_STATUSREG_RCVOK_Msk
#define BLUE_STATUSREG_RCVCRCERR_Pos                                       (30UL)   /*!<BLUE STATUSREG: RCVCRCERR (Bit 30) */
#define BLUE_STATUSREG_RCVCRCERR_Msk                                       (0x40000000UL)   /*!< BLUE STATUSREG: RCVCRCERR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVCRCERR                                           BLUE_STATUSREG_RCVCRCERR_Msk
#define BLUE_STATUSREG_TIMECAPTURETRIG_Pos                                 (29UL)   /*!<BLUE STATUSREG: TIMECAPTURETRIG (Bit 29) */
#define BLUE_STATUSREG_TIMECAPTURETRIG_Msk                                 (0x20000000UL)   /*!< BLUE STATUSREG: TIMECAPTURETRIG (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TIMECAPTURETRIG                                     BLUE_STATUSREG_TIMECAPTURETRIG_Msk
#define BLUE_STATUSREG_RCVCMD_Pos                                          (28UL)   /*!<BLUE STATUSREG: RCVCMD (Bit 28) */
#define BLUE_STATUSREG_RCVCMD_Msk                                          (0x10000000UL)   /*!< BLUE STATUSREG: RCVCMD (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVCMD                                              BLUE_STATUSREG_RCVCMD_Msk
#define BLUE_STATUSREG_RCVNOMD_Pos                                         (27UL)   /*!<BLUE STATUSREG: RCVNOMD (Bit 27) */
#define BLUE_STATUSREG_RCVNOMD_Msk                                         (0x8000000UL)    /*!< BLUE STATUSREG: RCVNOMD (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVNOMD                                             BLUE_STATUSREG_RCVNOMD_Msk
#define BLUE_STATUSREG_RCVTIMEOUT_Pos                                      (26UL)   /*!<BLUE STATUSREG: RCVTIMEOUT (Bit 26) */
#define BLUE_STATUSREG_RCVTIMEOUT_Msk                                      (0x4000000UL)    /*!< BLUE STATUSREG: RCVTIMEOUT (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVTIMEOUT                                          BLUE_STATUSREG_RCVTIMEOUT_Msk
#define BLUE_STATUSREG_DONE_Pos                                            (25UL)   /*!<BLUE STATUSREG: DONE (Bit 25) */
#define BLUE_STATUSREG_DONE_Msk                                            (0x2000000UL)    /*!< BLUE STATUSREG: DONE (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_DONE                                                BLUE_STATUSREG_DONE_Msk
#define BLUE_STATUSREG_TXOK_Pos                                            (24UL)   /*!<BLUE STATUSREG: TXOK (Bit 24) */
#define BLUE_STATUSREG_TXOK_Msk                                            (0x1000000UL)    /*!< BLUE STATUSREG: TXOK (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXOK                                                BLUE_STATUSREG_TXOK_Msk
#define BLUE_STATUSREG_CONFIGERROR_Pos                                     (23UL)   /*!<BLUE STATUSREG: CONFIGERROR (Bit 23) */
#define BLUE_STATUSREG_CONFIGERROR_Msk                                     (0x800000UL)   /*!< BLUE STATUSREG: CONFIGERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_CONFIGERROR                                         BLUE_STATUSREG_CONFIGERROR_Msk
#define BLUE_STATUSREG_ACTIVE2ERROR_Pos                                    (22UL)   /*!<BLUE STATUSREG: ACTIVE2ERROR (Bit 22) */
#define BLUE_STATUSREG_ACTIVE2ERROR_Msk                                    (0x400000UL)   /*!< BLUE STATUSREG: ACTIVE2ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_ACTIVE2ERROR                                        BLUE_STATUSREG_ACTIVE2ERROR_Msk
#define BLUE_STATUSREG_TXRXSKIP_Pos                                        (21UL)   /*!<BLUE STATUSREG: TXRXSKIP (Bit 21) */
#define BLUE_STATUSREG_TXRXSKIP_Msk                                        (0x200000UL)   /*!< BLUE STATUSREG: TXRXSKIP (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXRXSKIP                                            BLUE_STATUSREG_TXRXSKIP_Msk
#define BLUE_STATUSREG_SEMATIMEOUTERROR_Pos                                (19UL)   /*!<BLUE STATUSREG: SEMATIMEOUTERROR (Bit 19) */
#define BLUE_STATUSREG_SEMATIMEOUTERROR_Msk                                (0x80000UL)    /*!< BLUE STATUSREG: SEMATIMEOUTERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_SEMATIMEOUTERROR                                    BLUE_STATUSREG_SEMATIMEOUTERROR_Msk
#define BLUE_STATUSREG_RCVLENGTHERROR_Pos                                  (18UL)   /*!<BLUE STATUSREG: RCVLENGTHERROR (Bit 18) */
#define BLUE_STATUSREG_RCVLENGTHERROR_Msk                                  (0x40000UL)    /*!< BLUE STATUSREG: RCVLENGTHERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RCVLENGTHERROR                                      BLUE_STATUSREG_RCVLENGTHERROR_Msk
#define BLUE_STATUSREG_NOACTIVELERROR_Pos                                  (16UL)   /*!<BLUE STATUSREG: NOACTIVELERROR (Bit 16) */
#define BLUE_STATUSREG_NOACTIVELERROR_Msk                                  (0x10000UL)    /*!< BLUE STATUSREG: NOACTIVELERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_NOACTIVELERROR                                      BLUE_STATUSREG_NOACTIVELERROR_Msk
#define BLUE_STATUSREG_TXDATAREADYERROR_Pos                                (15UL)   /*!<BLUE STATUSREG: TXDATAREADYERROR (Bit 15) */
#define BLUE_STATUSREG_TXDATAREADYERROR_Msk                                (0x8000UL)   /*!< BLUE STATUSREG: TXDATAREADYERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXDATAREADYERROR                                    BLUE_STATUSREG_TXDATAREADYERROR_Msk
#define BLUE_STATUSREG_ALLTABLEREADYERROR_Pos                              (14UL)   /*!<BLUE STATUSREG: ALLTABLEREADYERROR (Bit 14) */
#define BLUE_STATUSREG_ALLTABLEREADYERROR_Msk                              (0x4000UL)   /*!< BLUE STATUSREG: ALLTABLEREADYERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_ALLTABLEREADYERROR                                  BLUE_STATUSREG_ALLTABLEREADYERROR_Msk
#define BLUE_STATUSREG_ENCERROR_Pos                                        (13UL)   /*!<BLUE STATUSREG: ENCERROR (Bit 13) */
#define BLUE_STATUSREG_ENCERROR_Msk                                        (0x2000UL)   /*!< BLUE STATUSREG: ENCERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_ENCERROR                                            BLUE_STATUSREG_ENCERROR_Msk
#define BLUE_STATUSREG_TXERROR_4_Pos                                       (12UL)   /*!<BLUE STATUSREG: TXERROR_4 (Bit 12) */
#define BLUE_STATUSREG_TXERROR_4_Msk                                       (0x1000UL)   /*!< BLUE STATUSREG: TXERROR_4 (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXERROR_4                                           BLUE_STATUSREG_TXERROR_4_Msk
#define BLUE_STATUSREG_TXERROR_3_Pos                                       (11UL)   /*!<BLUE STATUSREG: TXERROR_3 (Bit 11) */
#define BLUE_STATUSREG_TXERROR_3_Msk                                       (0x800UL)    /*!< BLUE STATUSREG: TXERROR_3 (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXERROR_3                                           BLUE_STATUSREG_TXERROR_3_Msk
#define BLUE_STATUSREG_TXERROR_2_Pos                                       (10UL)   /*!<BLUE STATUSREG: TXERROR_2 (Bit 10) */
#define BLUE_STATUSREG_TXERROR_2_Msk                                       (0x400UL)    /*!< BLUE STATUSREG: TXERROR_2 (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXERROR_2                                           BLUE_STATUSREG_TXERROR_2_Msk
#define BLUE_STATUSREG_TXERROR_1_Pos                                       (9UL)    /*!<BLUE STATUSREG: TXERROR_1 (Bit 9) */
#define BLUE_STATUSREG_TXERROR_1_Msk                                       (0x200UL)    /*!< BLUE STATUSREG: TXERROR_1 (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXERROR_1                                           BLUE_STATUSREG_TXERROR_1_Msk
#define BLUE_STATUSREG_TXERROR_0_Pos                                       (8UL)    /*!<BLUE STATUSREG: TXERROR_0 (Bit 8) */
#define BLUE_STATUSREG_TXERROR_0_Msk                                       (0x100UL)    /*!< BLUE STATUSREG: TXERROR_0 (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_TXERROR_0                                           BLUE_STATUSREG_TXERROR_0_Msk
#define BLUE_STATUSREG_SEQDONE_Pos                                         (7UL)    /*!<BLUE STATUSREG: SEQDONE (Bit 7) */
#define BLUE_STATUSREG_SEQDONE_Msk                                         (0x80UL)   /*!< BLUE STATUSREG: SEQDONE (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_SEQDONE                                             BLUE_STATUSREG_SEQDONE_Msk
#define BLUE_STATUSREG_PREVTRANSMIT_Pos                                    (6UL)    /*!<BLUE STATUSREG: PREVTRANSMIT (Bit 6) */
#define BLUE_STATUSREG_PREVTRANSMIT_Msk                                    (0x40UL)   /*!< BLUE STATUSREG: PREVTRANSMIT (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_PREVTRANSMIT                                        BLUE_STATUSREG_PREVTRANSMIT_Msk
#define BLUE_STATUSREG_RXOVERFLOWERROR_Pos                                 (5UL)    /*!<BLUE STATUSREG: RXOVERFLOWERROR (Bit 5) */
#define BLUE_STATUSREG_RXOVERFLOWERROR_Msk                                 (0x20UL)   /*!< BLUE STATUSREG: RXOVERFLOWERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_RXOVERFLOWERROR                                     BLUE_STATUSREG_RXOVERFLOWERROR_Msk
#define BLUE_STATUSREG_ADDPOINTERROR_Pos                                   (4UL)    /*!<BLUE STATUSREG: ADDPOINTERROR (Bit 4) */
#define BLUE_STATUSREG_ADDPOINTERROR_Msk                                   (0x10UL)   /*!< BLUE STATUSREG: ADDPOINTERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_ADDPOINTERROR                                       BLUE_STATUSREG_ADDPOINTERROR_Msk
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Pos                           (3UL)    /*!<BLUE STATUSREG: NOT_SUPPORTED_FEATURE (Bit 3) */
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Msk                           (0x8UL)    /*!< BLUE STATUSREG: NOT_SUPPORTED_FEATURE (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE                               BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Msk
#define BLUE_STATUSREG_AESONFLYBUSY_Pos                                    (0UL)    /*!<BLUE STATUSREG: AESONFLYBUSY (Bit 0) */
#define BLUE_STATUSREG_AESONFLYBUSY_Msk                                    (0x1UL)    /*!< BLUE STATUSREG: AESONFLYBUSY (Bitfield-Mask: 0x01) */
#define BLUE_STATUSREG_AESONFLYBUSY                                        BLUE_STATUSREG_AESONFLYBUSY_Msk

