stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    MANAESCLEARTEXT3REG    =====================================================*/
#define BLUE_MANAESCLEARTEXT3REG_AES_Pos                                   (0UL)    /*!<BLUE MANAESCLEARTEXT3REG: AES (Bit 0) */
#define BLUE_MANAESCLEARTEXT3REG_AES_Msk                                   (0xffffffffUL)   /*!< BLUE MANAESCLEARTEXT3REG: AES (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCLEARTEXT3REG_AES                                       BLUE_MANAESCLEARTEXT3REG_AES_Msk
#define BLUE_MANAESCLEARTEXT3REG_AES_0                                     (0x1U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_1                                     (0x2U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_2                                     (0x4U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_3                                     (0x8U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_4                                     (0x10U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_5                                     (0x20U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_6                                     (0x40U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_7                                     (0x80U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_8                                     (0x100U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_9                                     (0x200U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_10                                    (0x400U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_11                                    (0x800U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_12                                    (0x1000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_13                                    (0x2000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_14                                    (0x4000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_15                                    (0x8000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_16                                    (0x10000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_17                                    (0x20000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_18                                    (0x40000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_19                                    (0x80000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_20                                    (0x100000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_21                                    (0x200000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_22                                    (0x400000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_23                                    (0x800000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_24                                    (0x1000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_25                                    (0x2000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_26                                    (0x4000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_27                                    (0x8000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_28                                    (0x10000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_29                                    (0x20000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_30                                    (0x40000000U << BLUE_MANAESCLEARTEXT3REG_AES_Pos)
#define BLUE_MANAESCLEARTEXT3REG_AES_31                                    (0x80000000UL << BLUE_MANAESCLEARTEXT3REG_AES_Pos)

/* =====================================================    MANAESCIPHERTEXT0REG    =====================================================*/
#define BLUE_MANAESCIPHERTEXT0REG_AES_Pos                                  (0UL)    /*!<BLUE MANAESCIPHERTEXT0REG: AES (Bit 0) */
#define BLUE_MANAESCIPHERTEXT0REG_AES_Msk                                  (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT0REG: AES (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT0REG_AES                                      BLUE_MANAESCIPHERTEXT0REG_AES_Msk
#define BLUE_MANAESCIPHERTEXT0REG_AES_0                                    (0x1U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_1                                    (0x2U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_2                                    (0x4U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_3                                    (0x8U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_4                                    (0x10U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_5                                    (0x20U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_6                                    (0x40U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_7                                    (0x80U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_8                                    (0x100U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_9                                    (0x200U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_10                                   (0x400U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_11                                   (0x800U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_12                                   (0x1000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_13                                   (0x2000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_14                                   (0x4000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_15                                   (0x8000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_16                                   (0x10000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_17                                   (0x20000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_18                                   (0x40000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_19                                   (0x80000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_20                                   (0x100000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_21                                   (0x200000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_22                                   (0x400000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_23                                   (0x800000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_24                                   (0x1000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_25                                   (0x2000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_26                                   (0x4000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_27                                   (0x8000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_28                                   (0x10000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_29                                   (0x20000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_30                                   (0x40000000U << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT0REG_AES_31                                   (0x80000000UL << BLUE_MANAESCIPHERTEXT0REG_AES_Pos)

/* =====================================================    MANAESCIPHERTEXT1REG    =====================================================*/
#define BLUE_MANAESCIPHERTEXT1REG_AES_Pos                                  (0UL)    /*!<BLUE MANAESCIPHERTEXT1REG: AES (Bit 0) */
#define BLUE_MANAESCIPHERTEXT1REG_AES_Msk                                  (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT1REG: AES (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT1REG_AES                                      BLUE_MANAESCIPHERTEXT1REG_AES_Msk
#define BLUE_MANAESCIPHERTEXT1REG_AES_0                                    (0x1U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_1                                    (0x2U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_2                                    (0x4U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_3                                    (0x8U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_4                                    (0x10U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_5                                    (0x20U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_6                                    (0x40U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_7                                    (0x80U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_8                                    (0x100U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_9                                    (0x200U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_10                                   (0x400U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_11                                   (0x800U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_12                                   (0x1000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_13                                   (0x2000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_14                                   (0x4000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_15                                   (0x8000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_16                                   (0x10000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_17                                   (0x20000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_18                                   (0x40000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_19                                   (0x80000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_20                                   (0x100000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_21                                   (0x200000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_22                                   (0x400000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_23                                   (0x800000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_24                                   (0x1000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_25                                   (0x2000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_26                                   (0x4000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_27                                   (0x8000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_28                                   (0x10000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_29                                   (0x20000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_30                                   (0x40000000U << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT1REG_AES_31                                   (0x80000000UL << BLUE_MANAESCIPHERTEXT1REG_AES_Pos)

/* =====================================================    MANAESCIPHERTEXT2REG    =====================================================*/
#define BLUE_MANAESCIPHERTEXT2REG_AES_Pos                                  (0UL)    /*!<BLUE MANAESCIPHERTEXT2REG: AES (Bit 0) */
#define BLUE_MANAESCIPHERTEXT2REG_AES_Msk                                  (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT2REG: AES (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT2REG_AES                                      BLUE_MANAESCIPHERTEXT2REG_AES_Msk
#define BLUE_MANAESCIPHERTEXT2REG_AES_0                                    (0x1U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_1                                    (0x2U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_2                                    (0x4U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_3                                    (0x8U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_4                                    (0x10U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_5                                    (0x20U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_6                                    (0x40U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_7                                    (0x80U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_8                                    (0x100U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_9                                    (0x200U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_10                                   (0x400U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_11                                   (0x800U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_12                                   (0x1000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_13                                   (0x2000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_14                                   (0x4000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_15                                   (0x8000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_16                                   (0x10000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_17                                   (0x20000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_18                                   (0x40000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_19                                   (0x80000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_20                                   (0x100000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_21                                   (0x200000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_22                                   (0x400000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_23                                   (0x800000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_24                                   (0x1000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_25                                   (0x2000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_26                                   (0x4000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_27                                   (0x8000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_28                                   (0x10000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_29                                   (0x20000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_30                                   (0x40000000U << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT2REG_AES_31                                   (0x80000000UL << BLUE_MANAESCIPHERTEXT2REG_AES_Pos)

/* =====================================================    MANAESCIPHERTEXT3REG    =====================================================*/
#define BLUE_MANAESCIPHERTEXT3REG_AES_Pos                                  (0UL)    /*!<BLUE MANAESCIPHERTEXT3REG: AES (Bit 0) */
#define BLUE_MANAESCIPHERTEXT3REG_AES_Msk                                  (0xffffffffUL)   /*!< BLUE MANAESCIPHERTEXT3REG: AES (Bitfield-Mask: 0xffffffff) */
#define BLUE_MANAESCIPHERTEXT3REG_AES                                      BLUE_MANAESCIPHERTEXT3REG_AES_Msk
#define BLUE_MANAESCIPHERTEXT3REG_AES_0                                    (0x1U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_1                                    (0x2U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_2                                    (0x4U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_3                                    (0x8U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_4                                    (0x10U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_5                                    (0x20U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_6                                    (0x40U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_7                                    (0x80U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_8                                    (0x100U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_9                                    (0x200U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_10                                   (0x400U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_11                                   (0x800U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_12                                   (0x1000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_13                                   (0x2000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_14                                   (0x4000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_15                                   (0x8000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_16                                   (0x10000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_17                                   (0x20000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_18                                   (0x40000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_19                                   (0x80000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_20                                   (0x100000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_21                                   (0x200000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_22                                   (0x400000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_23                                   (0x800000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_24                                   (0x1000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_25                                   (0x2000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_26                                   (0x4000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_27                                   (0x8000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_28                                   (0x10000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_29                                   (0x20000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_30                                   (0x40000000U << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)
#define BLUE_MANAESCIPHERTEXT3REG_AES_31                                   (0x80000000UL << BLUE_MANAESCIPHERTEXT3REG_AES_Pos)

/* =====================================================    MANAESCMDREG    =====================================================*/
#define BLUE_MANAESCMDREG_INTENA_Pos                                       (1UL)    /*!<BLUE MANAESCMDREG: INTENA (Bit 1) */
#define BLUE_MANAESCMDREG_INTENA_Msk                                       (0x2UL)    /*!< BLUE MANAESCMDREG: INTENA (Bitfield-Mask: 0x01) */
#define BLUE_MANAESCMDREG_INTENA                                           BLUE_MANAESCMDREG_INTENA_Msk
#define BLUE_MANAESCMDREG_START_Pos                                        (0UL)    /*!<BLUE MANAESCMDREG: START (Bit 0) */
#define BLUE_MANAESCMDREG_START_Msk                                        (0x1UL)    /*!< BLUE MANAESCMDREG: START (Bitfield-Mask: 0x01) */
#define BLUE_MANAESCMDREG_START                                            BLUE_MANAESCMDREG_START_Msk

