stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    MANAESSTATREG    =====================================================*/
#define BLUE_MANAESSTATREG_BUSY_Pos                                        (0UL)    /*!<BLUE MANAESSTATREG: BUSY (Bit 0) */
#define BLUE_MANAESSTATREG_BUSY_Msk                                        (0x1UL)    /*!< BLUE MANAESSTATREG: BUSY (Bitfield-Mask: 0x01) */
#define BLUE_MANAESSTATREG_BUSY                                            BLUE_MANAESSTATREG_BUSY_Msk

/* =====================================================    AESLEPRIVPOINTERREG    =====================================================*/
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Pos                               (0UL)    /*!<BLUE AESLEPRIVPOINTERREG: POINTER (Bit 0) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Msk                               (0xffffffUL)   /*!< BLUE AESLEPRIVPOINTERREG: POINTER (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER                                   BLUE_AESLEPRIVPOINTERREG_POINTER_Msk
#define BLUE_AESLEPRIVPOINTERREG_POINTER_0                                 (0x1U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_1                                 (0x2U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_2                                 (0x4U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_3                                 (0x8U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_4                                 (0x10U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_5                                 (0x20U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_6                                 (0x40U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_7                                 (0x80U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_8                                 (0x100U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_9                                 (0x200U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_10                                (0x400U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_11                                (0x800U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_12                                (0x1000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_13                                (0x2000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_14                                (0x4000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_15                                (0x8000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_16                                (0x10000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_17                                (0x20000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_18                                (0x40000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_19                                (0x80000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_20                                (0x100000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_21                                (0x200000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_22                                (0x400000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)
#define BLUE_AESLEPRIVPOINTERREG_POINTER_23                                (0x800000U << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)

/* =====================================================    AESLEPRIVHASHREG    =====================================================*/
#define BLUE_AESLEPRIVHASHREG_HASH_Pos                                     (0UL)    /*!<BLUE AESLEPRIVHASHREG: HASH (Bit 0) */
#define BLUE_AESLEPRIVHASHREG_HASH_Msk                                     (0xffffffUL)   /*!< BLUE AESLEPRIVHASHREG: HASH (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVHASHREG_HASH                                         BLUE_AESLEPRIVHASHREG_HASH_Msk
#define BLUE_AESLEPRIVHASHREG_HASH_0                                       (0x1U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_1                                       (0x2U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_2                                       (0x4U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_3                                       (0x8U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_4                                       (0x10U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_5                                       (0x20U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_6                                       (0x40U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_7                                       (0x80U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_8                                       (0x100U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_9                                       (0x200U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_10                                      (0x400U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_11                                      (0x800U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_12                                      (0x1000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_13                                      (0x2000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_14                                      (0x4000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_15                                      (0x8000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_16                                      (0x10000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_17                                      (0x20000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_18                                      (0x40000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_19                                      (0x80000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_20                                      (0x100000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_21                                      (0x200000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_22                                      (0x400000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)
#define BLUE_AESLEPRIVHASHREG_HASH_23                                      (0x800000U << BLUE_AESLEPRIVHASHREG_HASH_Pos)

/* =====================================================    AESLEPRIVPRANDREG    =====================================================*/
#define BLUE_AESLEPRIVPRANDREG_PRAND_Pos                                   (0UL)    /*!<BLUE AESLEPRIVPRANDREG: PRAND (Bit 0) */
#define BLUE_AESLEPRIVPRANDREG_PRAND_Msk                                   (0xffffffUL)   /*!< BLUE AESLEPRIVPRANDREG: PRAND (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPRANDREG_PRAND                                       BLUE_AESLEPRIVPRANDREG_PRAND_Msk
#define BLUE_AESLEPRIVPRANDREG_PRAND_0                                     (0x1U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_1                                     (0x2U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_2                                     (0x4U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_3                                     (0x8U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_4                                     (0x10U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_5                                     (0x20U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_6                                     (0x40U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_7                                     (0x80U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_8                                     (0x100U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_9                                     (0x200U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_10                                    (0x400U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_11                                    (0x800U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_12                                    (0x1000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_13                                    (0x2000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_14                                    (0x4000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_15                                    (0x8000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_16                                    (0x10000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_17                                    (0x20000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_18                                    (0x40000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_19                                    (0x80000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_20                                    (0x100000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_21                                    (0x200000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_22                                    (0x400000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_23                                    (0x800000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)

/* =====================================================    AESLEPRIVCMDREG    =====================================================*/
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Pos                                    (2UL)    /*!<BLUE AESLEPRIVCMDREG: NBKEYS (Bit 2) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Msk                                    (0x3fcUL)    /*!< BLUE AESLEPRIVCMDREG: NBKEYS (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS                                        BLUE_AESLEPRIVCMDREG_NBKEYS_Msk
#define BLUE_AESLEPRIVCMDREG_NBKEYS_0                                      (0x1U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_1                                      (0x2U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_2                                      (0x4U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_3                                      (0x8U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_4                                      (0x10U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_5                                      (0x20U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_6                                      (0x40U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_7                                      (0x80U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_INTENA_Pos                                    (1UL)    /*!<BLUE AESLEPRIVCMDREG: INTENA (Bit 1) */
#define BLUE_AESLEPRIVCMDREG_INTENA_Msk                                    (0x2UL)    /*!< BLUE AESLEPRIVCMDREG: INTENA (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVCMDREG_INTENA                                        BLUE_AESLEPRIVCMDREG_INTENA_Msk
#define BLUE_AESLEPRIVCMDREG_START_Pos                                     (0UL)    /*!<BLUE AESLEPRIVCMDREG: START (Bit 0) */
#define BLUE_AESLEPRIVCMDREG_START_Msk                                     (0x1UL)    /*!< BLUE AESLEPRIVCMDREG: START (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVCMDREG_START                                         BLUE_AESLEPRIVCMDREG_START_Msk

/* =====================================================    AESLEPRIVSTATREG    =====================================================*/
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos                              (2UL)    /*!<BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bit 2) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk                              (0x3fcUL)    /*!< BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX                                  BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_0                                (0x1U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_1                                (0x2U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_2                                (0x4U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_3                                (0x8U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_4                                (0x10U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_5                                (0x20U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_6                                (0x40U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_7                                (0x80U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFND_Pos                                   (1UL)    /*!<BLUE AESLEPRIVSTATREG: KEYFND (Bit 1) */
#define BLUE_AESLEPRIVSTATREG_KEYFND_Msk                                   (0x2UL)    /*!< BLUE AESLEPRIVSTATREG: KEYFND (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVSTATREG_KEYFND                                       BLUE_AESLEPRIVSTATREG_KEYFND_Msk
#define BLUE_AESLEPRIVSTATREG_BUSY_Pos                                     (0UL)    /*!<BLUE AESLEPRIVSTATREG: BUSY (Bit 0) */
#define BLUE_AESLEPRIVSTATREG_BUSY_Msk                                     (0x1UL)    /*!< BLUE AESLEPRIVSTATREG: BUSY (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVSTATREG_BUSY                                         BLUE_AESLEPRIVSTATREG_BUSY_Msk

/* =====================================================    DEBUGCMDREG    =====================================================*/
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos                                  (16UL)   /*!<BLUE DEBUGCMDREG: AESDEBUGMODE (Bit 16) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk                                  (0xf0000UL)    /*!< BLUE DEBUGCMDREG: AESDEBUGMODE (Bitfield-Mask: 0x0f) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE                                      BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_0                                    (0x1U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_1                                    (0x2U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_2                                    (0x4U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_3                                    (0x8U << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos                                (2UL)    /*!<BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bit 2) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk                                (0x3cUL)   /*!< BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bitfield-Mask: 0x0f) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL                                    BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_0                                  (0x1U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_1                                  (0x2U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_2                                  (0x4U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_3                                  (0x8U << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Pos                                  (1UL)    /*!<BLUE DEBUGCMDREG: SEQDEBUGMODE (Bit 1) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk                                  (0x2UL)    /*!< BLUE DEBUGCMDREG: SEQDEBUGMODE (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE                                      BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Pos                                 (0UL)    /*!<BLUE DEBUGCMDREG: CLEARDEBUGINT (Bit 0) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk                                 (0x1UL)    /*!< BLUE DEBUGCMDREG: CLEARDEBUGINT (Bitfield-Mask: 0x01) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT                                     BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk

/* =====================================================    STATUS2REG    =====================================================*/
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Pos        (31UL)   /*!<BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR (Bit 31) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Msk        (0x80000000UL)   /*!< BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR            BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Msk
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Pos         (30UL)   /*!<BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR (Bit 30) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Msk         (0x40000000UL)   /*!< BLUE STATUS2REG: ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR             BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Msk
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Pos                        (29UL)   /*!<BLUE STATUS2REG: IQSAMPLES_MISSING_ERROR (Bit 29) */
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Msk                        (0x20000000UL)   /*!< BLUE STATUS2REG: IQSAMPLES_MISSING_ERROR (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR                            BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Msk
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos                               (1UL)    /*!<BLUE STATUS2REG: IQSAMPLES_NUMBER (Bit 1) */
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_Msk                               (0xfeUL)   /*!< BLUE STATUS2REG: IQSAMPLES_NUMBER (Bitfield-Mask: 0x7f) */
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER                                   BLUE_STATUS2REG_IQSAMPLES_NUMBER_Msk
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_0                                 (0x1U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_1                                 (0x2U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_2                                 (0x4U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_3                                 (0x8U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_4                                 (0x10U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_5                                 (0x20U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_NUMBER_6                                 (0x40U << BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos)
#define BLUE_STATUS2REG_IQSAMPLES_READY_Pos                                (0UL)    /*!<BLUE STATUS2REG: IQSAMPLES_READY (Bit 0) */
#define BLUE_STATUS2REG_IQSAMPLES_READY_Msk                                (0x1UL)    /*!< BLUE STATUS2REG: IQSAMPLES_READY (Bitfield-Mask: 0x01) */
#define BLUE_STATUS2REG_IQSAMPLES_READY                                    BLUE_STATUS2REG_IQSAMPLES_READY_Msk


