stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* ============================================================================================================================*/
/*=====================                                      WAKEUP                                      =====================*/
/* ============================================================================================================================*/

/* =====================================================    WAKEUP_OFFSET    =====================================================*/
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos                             (0UL)    /*!<WAKEUP WAKEUP_OFFSET: WAKEUP_OFFSET (Bit 0) */
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Msk                             (0xffUL)   /*!< WAKEUP WAKEUP_OFFSET: WAKEUP_OFFSET (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET                                 WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Msk
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_0                               (0x1U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_1                               (0x2U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_2                               (0x4U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_3                               (0x8U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_4                               (0x10U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_5                               (0x20U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_6                               (0x40U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)
#define WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_7                               (0x80U << WAKEUP_WAKEUP_OFFSET_WAKEUP_OFFSET_Pos)

/* =====================================================    ABSOLUTE_TIME    =====================================================*/
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos                             (0UL)    /*!<WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bit 0) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk                             (0xffffffffUL)   /*!< WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bitfield-Mask: 0xffffffff) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME                                 WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_0                               (0x1U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_1                               (0x2U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_2                               (0x4U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_3                               (0x8U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_4                               (0x10U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_5                               (0x20U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_6                               (0x40U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_7                               (0x80U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_8                               (0x100U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_9                               (0x200U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_10                              (0x400U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_11                              (0x800U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_12                              (0x1000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_13                              (0x2000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_14                              (0x4000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_15                              (0x8000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_16                              (0x10000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_17                              (0x20000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_18                              (0x40000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_19                              (0x80000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_20                              (0x100000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_21                              (0x200000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_22                              (0x400000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_23                              (0x800000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_24                              (0x1000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_25                              (0x2000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_26                              (0x4000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_27                              (0x8000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_28                              (0x10000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_29                              (0x20000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_30                              (0x40000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_31                              (0x80000000UL << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)

/* =====================================================    MINIMUM_PERIOD_LENGTH    =====================================================*/
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)    /*!<WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x3ff0UL)   /*!< WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_0                              (0x1U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_1                              (0x2U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_2                              (0x4U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_3                              (0x8U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200U << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)

/* =====================================================    AVERAGE_PERIOD_LENGTH    =====================================================*/
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos                     (24UL)   /*!<WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bit 24) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk                     (0xff000000UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bitfield-Mask: 0xff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT                         WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_0                       (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_1                       (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_2                       (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_3                       (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_4                       (0x10U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_5                       (0x20U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_6                       (0x40U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_7                       (0x80U << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos                        (4UL)    /*!<WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bit 4) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk                        (0x3ff0UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bitfield-Mask: 0x3ff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT                            WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_0                          (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_1                          (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_2                          (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_3                          (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_4                          (0x10U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_5                          (0x20U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_6                          (0x40U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_7                          (0x80U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_8                          (0x100U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_9                          (0x200U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos                      (0UL)    /*!<WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRACT (Bit 0) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Msk                      (0xfUL)    /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRACT (Bitfield-Mask: 0x0f) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT                          WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_0                        (0x1U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_1                        (0x2U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_2                        (0x4U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_3                        (0x8U << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)

/* =====================================================    MAXIMUM_PERIOD_LENGTH    =====================================================*/
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)    /*!<WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x3ff0UL)   /*!< WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_0                              (0x1U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_1                              (0x2U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_2                              (0x4U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_3                              (0x8U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200U << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)

