stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    WAKEUP_BLE_IRQ_STATUS    =====================================================*/
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Pos                         (0UL)    /*!<WAKEUP WAKEUP_BLE_IRQ_STATUS: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Msk                         (0x1UL)    /*!< WAKEUP WAKEUP_BLE_IRQ_STATUS: WAKEUP_IT (Bitfield-Mask: 0x01) */
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT                             WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Msk

/* =====================================================    WAKEUP_CM0_IRQ_ENABLE    =====================================================*/
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Pos                         (0UL)    /*!<WAKEUP WAKEUP_CM0_IRQ_ENABLE: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Msk                         (0x1UL)    /*!< WAKEUP WAKEUP_CM0_IRQ_ENABLE: WAKEUP_IT (Bitfield-Mask: 0x01) */
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT                             WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Msk

/* =====================================================    WAKEUP_CM0_IRQ_STATUS    =====================================================*/
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Pos                         (0UL)    /*!<WAKEUP WAKEUP_CM0_IRQ_STATUS: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Msk                         (0x1UL)    /*!< WAKEUP WAKEUP_CM0_IRQ_STATUS: WAKEUP_IT (Bitfield-Mask: 0x01) */
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT                             WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Msk


/* ============================================================================================================================*/
/*=====================                                    RADIO_CTRL                                    =====================*/
/* ============================================================================================================================*/

/* =====================================================    RADIO_CONTROL_ID    =====================================================*/
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Pos                            (12UL)   /*!<RADIO_CTRL RADIO_CONTROL_ID: PRODUCT (Bit 12) */
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Msk                            (0xf000UL)   /*!< RADIO_CTRL RADIO_CONTROL_ID: PRODUCT (Bitfield-Mask: 0x0f) */
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT                                RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Msk
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_0                              (0x1U << RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_1                              (0x2U << RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_2                              (0x4U << RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_3                              (0x8U << RADIO_CTRL_RADIO_CONTROL_ID_PRODUCT_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Pos                            (8UL)    /*!<RADIO_CTRL RADIO_CONTROL_ID: VERSION (Bit 8) */
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Msk                            (0xf00UL)    /*!< RADIO_CTRL RADIO_CONTROL_ID: VERSION (Bitfield-Mask: 0x0f) */
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION                                RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Msk
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_0                              (0x1U << RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_1                              (0x2U << RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_2                              (0x4U << RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_VERSION_3                              (0x8U << RADIO_CTRL_RADIO_CONTROL_ID_VERSION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Pos                           (4UL)    /*!<RADIO_CTRL RADIO_CONTROL_ID: REVISION (Bit 4) */
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Msk                           (0xf0UL)   /*!< RADIO_CTRL RADIO_CONTROL_ID: REVISION (Bitfield-Mask: 0x0f) */
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION                               RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Msk
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_0                             (0x1U << RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_1                             (0x2U << RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_2                             (0x4U << RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Pos)
#define RADIO_CTRL_RADIO_CONTROL_ID_REVISION_3                             (0x8U << RADIO_CTRL_RADIO_CONTROL_ID_REVISION_Pos)

/* =====================================================    CLK32COUNT_REG    =====================================================*/
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos                           (0UL)    /*!<RADIO_CTRL CLK32COUNT_REG: SLOW_COUNT (Bit 0) */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Msk                           (0x1ffUL)    /*!< RADIO_CTRL CLK32COUNT_REG: SLOW_COUNT (Bitfield-Mask: 0x1ff) */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT                               RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Msk
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_0                             (0x1U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_1                             (0x2U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_2                             (0x4U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_3                             (0x8U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_4                             (0x10U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_5                             (0x20U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_6                             (0x40U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_7                             (0x80U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_8                             (0x100U << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)

/* =====================================================    CLK32PERIOD_REG    =====================================================*/
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos                         (0UL)    /*!<RADIO_CTRL CLK32PERIOD_REG: SLOW_PERIOD (Bit 0) */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Msk                         (0x7ffffUL)    /*!< RADIO_CTRL CLK32PERIOD_REG: SLOW_PERIOD (Bitfield-Mask: 0x7ffff) */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD                             RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Msk
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_0                           (0x1U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_1                           (0x2U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_2                           (0x4U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_3                           (0x8U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_4                           (0x10U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_5                           (0x20U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_6                           (0x40U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_7                           (0x80U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_8                           (0x100U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_9                           (0x200U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_10                          (0x400U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_11                          (0x800U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_12                          (0x1000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_13                          (0x2000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_14                          (0x4000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_15                          (0x8000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_16                          (0x10000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_17                          (0x20000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_18                          (0x40000U << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)

/* =====================================================    CLK32FREQUENCY_REG    =====================================================*/
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos                   (0UL)    /*!<RADIO_CTRL CLK32FREQUENCY_REG: SLOW_FREQUENCY (Bit 0) */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Msk                   (0x7ffffffUL)    /*!< RADIO_CTRL CLK32FREQUENCY_REG: SLOW_FREQUENCY (Bitfield-Mask: 0x7ffffff) */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY                       RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Msk
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_0                     (0x1U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_1                     (0x2U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_2                     (0x4U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_3                     (0x8U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_4                     (0x10U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_5                     (0x20U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_6                     (0x40U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_7                     (0x80U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_8                     (0x100U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_9                     (0x200U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_10                    (0x400U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_11                    (0x800U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_12                    (0x1000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_13                    (0x2000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_14                    (0x4000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_15                    (0x8000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_16                    (0x10000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_17                    (0x20000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_18                    (0x40000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_19                    (0x80000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_20                    (0x100000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_21                    (0x200000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_22                    (0x400000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_23                    (0x800000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_24                    (0x1000000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_25                    (0x2000000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_26                    (0x4000000U << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)

/* =====================================================    RADIO_CONTROL_IRQ_STATUS    =====================================================*/
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos              (8UL)    /*!<RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: RADIO_FSM_IRQ (Bit 8) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Msk              (0x3f00UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: RADIO_FSM_IRQ (Bitfield-Mask: 0x3f) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ                  RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_0                (0x1U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_1                (0x2U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_2                (0x4U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_3                (0x8U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_4                (0x10U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_5                (0x20U << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Pos               (0UL)    /*!<RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: SLOW_CLK_IRQ (Bit 0) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Msk               (0x1UL)    /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: SLOW_CLK_IRQ (Bitfield-Mask: 0x01) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ                   RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Msk

