stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    RADIO_CONTROL_IRQ_ENABLE    =====================================================*/
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos         (8UL)    /*!<RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: RADIO_FSM_IRQ_MASK (Bit 8) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Msk         (0x3f00UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: RADIO_FSM_IRQ_MASK (Bitfield-Mask: 0x3f) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK             RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_0           (0x1U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_1           (0x2U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_2           (0x4U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_3           (0x8U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_4           (0x10U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_5           (0x20U << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Pos          (0UL)    /*!<RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: SLOW_CLK_IRQ_MASK (Bit 0) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Msk          (0x1UL)    /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: SLOW_CLK_IRQ_MASK (Bitfield-Mask: 0x01) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK              RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Msk


/* ============================================================================================================================*/
/*=====================                                        RRM                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    UDRA_CTRL0    =====================================================*/
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Pos                                 (0UL)    /*!<RRM UDRA_CTRL0: RELOAD_RDCFGPTR (Bit 0) */
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Msk                                 (0x1UL)    /*!< RRM UDRA_CTRL0: RELOAD_RDCFGPTR (Bitfield-Mask: 0x01) */
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR                                     RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Msk

/* =====================================================    UDRA_IRQ_ENABLE    =====================================================*/
#define RRM_UDRA_IRQ_ENABLE_CMD_END_Pos                                    (2UL)    /*!<RRM UDRA_IRQ_ENABLE: CMD_END (Bit 2) */
#define RRM_UDRA_IRQ_ENABLE_CMD_END_Msk                                    (0x4UL)    /*!< RRM UDRA_IRQ_ENABLE: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_ENABLE_CMD_END                                        RRM_UDRA_IRQ_ENABLE_CMD_END_Msk
#define RRM_UDRA_IRQ_ENABLE_CMD_START_Pos                                  (1UL)    /*!<RRM UDRA_IRQ_ENABLE: CMD_START (Bit 1) */
#define RRM_UDRA_IRQ_ENABLE_CMD_START_Msk                                  (0x2UL)    /*!< RRM UDRA_IRQ_ENABLE: CMD_START (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_ENABLE_CMD_START                                      RRM_UDRA_IRQ_ENABLE_CMD_START_Msk
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Pos                     (0UL)    /*!<RRM UDRA_IRQ_ENABLE: RADIO_CFG_PTR_RELOADED (Bit 0) */
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Msk                     (0x1UL)    /*!< RRM UDRA_IRQ_ENABLE: RADIO_CFG_PTR_RELOADED (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED                         RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Msk

/* =====================================================    UDRA_IRQ_STATUS    =====================================================*/
#define RRM_UDRA_IRQ_STATUS_CMD_END_Pos                                    (2UL)    /*!<RRM UDRA_IRQ_STATUS: CMD_END (Bit 2) */
#define RRM_UDRA_IRQ_STATUS_CMD_END_Msk                                    (0x4UL)    /*!< RRM UDRA_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_STATUS_CMD_END                                        RRM_UDRA_IRQ_STATUS_CMD_END_Msk
#define RRM_UDRA_IRQ_STATUS_CMD_STARD_Pos                                  (1UL)    /*!<RRM UDRA_IRQ_STATUS: CMD_STARD (Bit 1) */
#define RRM_UDRA_IRQ_STATUS_CMD_STARD_Msk                                  (0x2UL)    /*!< RRM UDRA_IRQ_STATUS: CMD_STARD (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_STATUS_CMD_STARD                                      RRM_UDRA_IRQ_STATUS_CMD_STARD_Msk
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Pos                     (0UL)    /*!<RRM UDRA_IRQ_STATUS: RADIO_CFG_PTR_RELOADED (Bit 0) */
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Msk                     (0x1UL)    /*!< RRM UDRA_IRQ_STATUS: RADIO_CFG_PTR_RELOADED (Bitfield-Mask: 0x01) */
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED                         RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Msk

/* =====================================================    UDRA_RADIO_CFG_PTR    =====================================================*/
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos                    (0UL)    /*!<RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bit 0) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk                    (0xffffffffUL)   /*!< RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bitfield-Mask: 0xffffffff) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS                        RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_0                      (0x1U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_1                      (0x2U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_2                      (0x4U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_3                      (0x8U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_4                      (0x10U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_5                      (0x20U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_6                      (0x40U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_7                      (0x80U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_8                      (0x100U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_9                      (0x200U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_10                     (0x400U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_11                     (0x800U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_12                     (0x1000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_13                     (0x2000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_14                     (0x4000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_15                     (0x8000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_16                     (0x10000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_17                     (0x20000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_18                     (0x40000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_19                     (0x80000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_20                     (0x100000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_21                     (0x200000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_22                     (0x400000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_23                     (0x800000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_24                     (0x1000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_25                     (0x2000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_26                     (0x4000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_27                     (0x8000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_28                     (0x10000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_29                     (0x20000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_30                     (0x40000000U << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_31                     (0x80000000UL << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)

/* =====================================================    SEMA_IRQ_ENABLE    =====================================================*/
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Pos                                     (1UL)    /*!<RRM SEMA_IRQ_ENABLE: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk                                     (0x2UL)    /*!< RRM SEMA_IRQ_ENABLE: UNLOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK                                         RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk
#define RRM_SEMA_IRQ_ENABLE_LOCK_Pos                                       (0UL)    /*!<RRM SEMA_IRQ_ENABLE: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_ENABLE_LOCK_Msk                                       (0x1UL)    /*!< RRM SEMA_IRQ_ENABLE: LOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_ENABLE_LOCK                                           RRM_SEMA_IRQ_ENABLE_LOCK_Msk

/* =====================================================    SEMA_IRQ_STATUS    =====================================================*/
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Pos                                     (1UL)    /*!<RRM SEMA_IRQ_STATUS: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Msk                                     (0x2UL)    /*!< RRM SEMA_IRQ_STATUS: UNLOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK                                         RRM_SEMA_IRQ_STATUS_UNLOCK_Msk
#define RRM_SEMA_IRQ_STATUS_LOCK_Pos                                       (0UL)    /*!<RRM SEMA_IRQ_STATUS: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_STATUS_LOCK_Msk                                       (0x1UL)    /*!< RRM SEMA_IRQ_STATUS: LOCK (Bitfield-Mask: 0x01) */
#define RRM_SEMA_IRQ_STATUS_LOCK                                           RRM_SEMA_IRQ_STATUS_LOCK_Msk

/* =====================================================    BLE_IRQ_ENABLE    =====================================================*/
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Pos                                (4UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk                                (0x10UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END                                    RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Pos                              (3UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk                              (0x8UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START                                  RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Pos                                (1UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk                                (0x2UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE                                    RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Pos                                  (0UL)    /*!<RRM BLE_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk                                  (0x1UL)    /*!< RRM BLE_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT                                      RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk

/* =====================================================    BLE_IRQ_STATUS    =====================================================*/
#define RRM_BLE_IRQ_STATUS_CMD_END_Pos                                     (4UL)    /*!<RRM BLE_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_BLE_IRQ_STATUS_CMD_END_Msk                                     (0x10UL)   /*!< RRM BLE_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_CMD_END                                         RRM_BLE_IRQ_STATUS_CMD_END_Msk
#define RRM_BLE_IRQ_STATUS_CMD_START_Pos                                   (3UL)    /*!<RRM BLE_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_BLE_IRQ_STATUS_CMD_START_Msk                                   (0x8UL)    /*!< RRM BLE_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_CMD_START                                       RRM_BLE_IRQ_STATUS_CMD_START_Msk
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Pos                                (1UL)    /*!<RRM BLE_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk                                (0x2UL)    /*!< RRM BLE_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE                                    RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Pos                                  (0UL)    /*!<RRM BLE_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk                                  (0x1UL)    /*!< RRM BLE_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT                                      RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk

/* =====================================================    VP_CPU_CMD_BUS    =====================================================*/
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Pos                                 (3UL)    /*!<RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bit 3) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk                                 (0x8UL)    /*!< RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ                                     RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk
#define RRM_VP_CPU_CMD_BUS_COMMAND_Pos                                     (0UL)    /*!<RRM VP_CPU_CMD_BUS: COMMAND (Bit 0) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_Msk                                     (0x7UL)    /*!< RRM VP_CPU_CMD_BUS: COMMAND (Bitfield-Mask: 0x07) */
#define RRM_VP_CPU_CMD_BUS_COMMAND                                         RRM_VP_CPU_CMD_BUS_COMMAND_Msk
#define RRM_VP_CPU_CMD_BUS_COMMAND_0                                       (0x1U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)
#define RRM_VP_CPU_CMD_BUS_COMMAND_1                                       (0x2U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)
#define RRM_VP_CPU_CMD_BUS_COMMAND_2                                       (0x4U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)

/* =====================================================    VP_CPU_SEMA_BUS    =====================================================*/
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Pos                                   (3UL)    /*!<RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bit 3) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk                                   (0x8UL)    /*!< RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ                                       RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos                                  (0UL)    /*!<RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bit 0) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk                                  (0x7UL)    /*!< RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bitfield-Mask: 0x07) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO                                      RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_0                                    (0x1U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_1                                    (0x2U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_2                                    (0x4U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)

/* =====================================================    VP_CPU_IRQ_ENABLE    =====================================================*/
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Pos                             (4UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk                             (0x10UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END                                 RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Pos                           (3UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk                           (0x8UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START                               RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Pos                             (1UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk                             (0x2UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE                                 RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Pos                               (0UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk                               (0x1UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT                                   RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk

/* =====================================================    VP_CPU_IRQ_STATUS    =====================================================*/
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Pos                                  (4UL)    /*!<RRM VP_CPU_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk                                  (0x10UL)   /*!< RRM VP_CPU_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END                                      RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Pos                                (3UL)    /*!<RRM VP_CPU_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk                                (0x8UL)    /*!< RRM VP_CPU_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START                                    RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Pos                             (2UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bit 2) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk                             (0x4UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT                                 RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Pos                             (1UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk                             (0x2UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE                                 RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Pos                               (0UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk                               (0x1UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT                                   RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk

/* =====================================================    AA0_DIG_USR    =====================================================*/
#define RRM_AA0_DIG_USR_AA_7_0_Pos                                         (0UL)    /*!<RRM AA0_DIG_USR: AA_7_0 (Bit 0) */
#define RRM_AA0_DIG_USR_AA_7_0_Msk                                         (0xffUL)   /*!< RRM AA0_DIG_USR: AA_7_0 (Bitfield-Mask: 0xff) */
#define RRM_AA0_DIG_USR_AA_7_0                                             RRM_AA0_DIG_USR_AA_7_0_Msk
#define RRM_AA0_DIG_USR_AA_7_0_0                                           (0x1U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_1                                           (0x2U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_2                                           (0x4U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_3                                           (0x8U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_4                                           (0x10U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_5                                           (0x20U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_6                                           (0x40U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_7                                           (0x80U << RRM_AA0_DIG_USR_AA_7_0_Pos)

