stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    PHYCTRL_DIG_USR    =====================================================*/
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos                                    (0UL)    /*!<RRM PHYCTRL_DIG_USR: RXTXPHY (Bit 0) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk                                    (0x7UL)    /*!< RRM PHYCTRL_DIG_USR: RXTXPHY (Bitfield-Mask: 0x07) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY                                        RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_0                                      (0x1U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_1                                      (0x2U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_2                                      (0x4U << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)

/* =====================================================    AFC1_DIG_ENG    =====================================================*/
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos                              (4UL)    /*!<RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bit 4) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk                              (0xf0UL)   /*!< RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE                                  RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_0                                (0x1U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_1                                (0x2U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_2                                (0x4U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_3                                (0x8U << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos                               (0UL)    /*!<RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bit 0) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk                               (0xfUL)    /*!< RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER                                   RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_0                                 (0x1U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_1                                 (0x2U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_2                                 (0x4U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_3                                 (0x8U << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)

/* =====================================================    CR0_DIG_ENG    =====================================================*/
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos                                 (4UL)    /*!<RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk                                 (0xf0UL)   /*!< RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE                                     RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_0                                   (0x1U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_1                                   (0x2U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_2                                   (0x4U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_3                                   (0x8U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos                                  (0UL)    /*!<RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk                                  (0xfUL)    /*!< RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER                                      RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_0                                    (0x1U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_1                                    (0x2U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_2                                    (0x4U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_3                                    (0x8U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)

/* =====================================================    CR0_LR    =====================================================*/
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos                                   (4UL)    /*!<RRM CR0_LR: CR_LR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk                                   (0xf0UL)   /*!< RRM CR0_LR: CR_LR_GAIN_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE                                       RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_0                                     (0x1U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_1                                     (0x2U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_2                                     (0x4U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_3                                     (0x8U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos                                    (0UL)    /*!<RRM CR0_LR: CR_LR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk                                    (0xfUL)    /*!< RRM CR0_LR: CR_LR_GAIN_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER                                        RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_0                                      (0x1U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_1                                      (0x2U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_2                                      (0x4U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_3                                      (0x8U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)

