stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    SYNTHCAL0_DIG_ENG    =====================================================*/
#define RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_Pos                        (6UL)    /*!<RRM SYNTHCAL0_DIG_ENG: SYNTH_IF_FREQ_CAL (Bit 6) */
#define RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_Msk                        (0xc0UL)   /*!< RRM SYNTHCAL0_DIG_ENG: SYNTH_IF_FREQ_CAL (Bitfield-Mask: 0x03) */
#define RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL                            RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_Msk
#define RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_0                          (0x1U << RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_Pos)
#define RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_1                          (0x2U << RRM_SYNTHCAL0_DIG_ENG_SYNTH_IF_FREQ_CAL_Pos)
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Pos                   (0UL)    /*!<RRM SYNTHCAL0_DIG_ENG: SYNTHCAL_DEBUG_BUS_SEL (Bit 0) */
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Msk                   (0xfUL)    /*!< RRM SYNTHCAL0_DIG_ENG: SYNTHCAL_DEBUG_BUS_SEL (Bitfield-Mask: 0x0f) */
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL                       RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Msk
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_0                     (0x1U << RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Pos)
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_1                     (0x2U << RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Pos)
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_2                     (0x4U << RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Pos)
#define RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_3                     (0x8U << RRM_SYNTHCAL0_DIG_ENG_SYNTHCAL_DEBUG_BUS_SEL_Pos)

/* =====================================================    RXADC_ANA_USR    =====================================================*/
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos                        (3UL)    /*!<RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk                        (0x38UL)   /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_0                          (0x1U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_1                          (0x2U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_2                          (0x4U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos                        (0UL)    /*!<RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk                        (0x7UL)    /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_0                          (0x1U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_1                          (0x2U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_2                          (0x4U << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)

/* =====================================================    LDO_ANA_ENG    =====================================================*/
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Pos                              (0UL)    /*!<RRM LDO_ANA_ENG: RFD_RF_REG_BYPASS (Bit 0) */
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Msk                              (0x1UL)    /*!< RRM LDO_ANA_ENG: RFD_RF_REG_BYPASS (Bitfield-Mask: 0x01) */
#define RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS                                  RRM_LDO_ANA_ENG_RFD_RF_REG_BYPASS_Msk

/* =====================================================    CBIAS0_ANA_ENG    =====================================================*/
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos                        (4UL)    /*!<RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk                        (0xf0UL)   /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_0                          (0x1U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_1                          (0x2U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_2                          (0x4U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_3                          (0x8U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos                        (0UL)    /*!<RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk                        (0xfUL)    /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_0                          (0x1U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_1                          (0x2U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_2                          (0x4U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_3                          (0x8U << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)

/* =====================================================    CBIAS1_ANA_ENG    =====================================================*/
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos                          (0UL)    /*!<RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bit 0) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk                          (0xfUL)    /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM                              RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_0                            (0x1U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_1                            (0x2U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_2                            (0x4U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_3                            (0x8U << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)

/* =====================================================    SYNTHCAL0_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos                       (0UL)    /*!<RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bit 0) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk                       (0x7fUL)   /*!< RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0                           RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_0                         (0x1U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_1                         (0x2U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_2                         (0x4U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_3                         (0x8U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_4                         (0x10U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_5                         (0x20U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_6                         (0x40U << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)

