stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    SYNTHCAL1_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos                      (0UL)    /*!<RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bit 0) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk                      (0xfUL)    /*!< RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bitfield-Mask: 0x0f) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7                          RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_0                        (0x1U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_1                        (0x2U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_2                        (0x4U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_3                        (0x8U << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)

/* =====================================================    SYNTHCAL2_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos                          (0UL)    /*!<RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bit 0) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk                          (0x7fUL)   /*!< RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT                              RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_0                            (0x1U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_1                            (0x2U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_2                            (0x4U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_3                            (0x8U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_4                            (0x10U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_5                            (0x20U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_6                            (0x40U << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)

/* =====================================================    SYNTHCAL3_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos                       (0UL)    /*!<RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bit 0) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk                       (0xffUL)   /*!< RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bitfield-Mask: 0xff) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS                           RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_0                         (0x1U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_1                         (0x2U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_2                         (0x4U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_3                         (0x8U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_4                         (0x10U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_5                         (0x20U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_6                         (0x40U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_7                         (0x80U << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)

/* =====================================================    SYNTHCAL4_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos                     (0UL)    /*!<RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bit 0) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk                     (0x3fUL)   /*!< RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bitfield-Mask: 0x3f) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT                         RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_0                       (0x1U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_1                       (0x2U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_2                       (0x4U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_3                       (0x8U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_4                       (0x10U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_5                       (0x20U << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)

/* =====================================================    SYNTHCAL5_DIG_OUT    =====================================================*/
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos                           (0UL)    /*!<RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bit 0) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk                           (0xfUL)    /*!< RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bitfield-Mask: 0x0f) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD                               RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_0                             (0x1U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_1                             (0x2U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_2                             (0x4U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_3                             (0x8U << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)

