stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    AGC1_DIG_ENG    =====================================================*/
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Pos                                 (7UL)    /*!<RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bit 7) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk                                 (0x80UL)   /*!< RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bitfield-Mask: 0x01) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC                                     RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Pos                                  (6UL)    /*!<RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bit 6) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk                                  (0x40UL)   /*!< RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bitfield-Mask: 0x01) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK                                      RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos                                 (0UL)    /*!<RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bit 0) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk                                 (0x3fUL)   /*!< RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bitfield-Mask: 0x3f) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6                                     RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_0                                   (0x1U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_1                                   (0x2U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_2                                   (0x4U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_3                                   (0x8U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_4                                   (0x10U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_5                                   (0x20U << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)

/* =====================================================    AGC10_DIG_ENG    =====================================================*/
#define RRM_AGC10_DIG_ENG_ATT_ANT_0_Pos                                    (4UL)    /*!<RRM AGC10_DIG_ENG: ATT_ANT_0 (Bit 4) */
#define RRM_AGC10_DIG_ENG_ATT_ANT_0_Msk                                    (0x30UL)   /*!< RRM AGC10_DIG_ENG: ATT_ANT_0 (Bitfield-Mask: 0x03) */
#define RRM_AGC10_DIG_ENG_ATT_ANT_0                                        RRM_AGC10_DIG_ENG_ATT_ANT_0_Msk
#define RRM_AGC10_DIG_ENG_ATT_ANT_0_0                                      (0x1U << RRM_AGC10_DIG_ENG_ATT_ANT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_ANT_0_1                                      (0x2U << RRM_AGC10_DIG_ENG_ATT_ANT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_LNA_0_Pos                                    (3UL)    /*!<RRM AGC10_DIG_ENG: ATT_LNA_0 (Bit 3) */
#define RRM_AGC10_DIG_ENG_ATT_LNA_0_Msk                                    (0x8UL)    /*!< RRM AGC10_DIG_ENG: ATT_LNA_0 (Bitfield-Mask: 0x01) */
#define RRM_AGC10_DIG_ENG_ATT_LNA_0                                        RRM_AGC10_DIG_ENG_ATT_LNA_0_Msk
#define RRM_AGC10_DIG_ENG_ATT_IF_0_Pos                                     (0UL)    /*!<RRM AGC10_DIG_ENG: ATT_IF_0 (Bit 0) */
#define RRM_AGC10_DIG_ENG_ATT_IF_0_Msk                                     (0x7UL)    /*!< RRM AGC10_DIG_ENG: ATT_IF_0 (Bitfield-Mask: 0x07) */
#define RRM_AGC10_DIG_ENG_ATT_IF_0                                         RRM_AGC10_DIG_ENG_ATT_IF_0_Msk
#define RRM_AGC10_DIG_ENG_ATT_IF_0_0                                       (0x1U << RRM_AGC10_DIG_ENG_ATT_IF_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_IF_0_1                                       (0x2U << RRM_AGC10_DIG_ENG_ATT_IF_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_IF_0_2                                       (0x4U << RRM_AGC10_DIG_ENG_ATT_IF_0_Pos)

/* =====================================================    AGC11_DIG_ENG    =====================================================*/
#define RRM_AGC11_DIG_ENG_ATT_ANT_1_Pos                                    (4UL)    /*!<RRM AGC11_DIG_ENG: ATT_ANT_1 (Bit 4) */
#define RRM_AGC11_DIG_ENG_ATT_ANT_1_Msk                                    (0x30UL)   /*!< RRM AGC11_DIG_ENG: ATT_ANT_1 (Bitfield-Mask: 0x03) */
#define RRM_AGC11_DIG_ENG_ATT_ANT_1                                        RRM_AGC11_DIG_ENG_ATT_ANT_1_Msk
#define RRM_AGC11_DIG_ENG_ATT_ANT_1_0                                      (0x1U << RRM_AGC11_DIG_ENG_ATT_ANT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_ANT_1_1                                      (0x2U << RRM_AGC11_DIG_ENG_ATT_ANT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_LNA_1_Pos                                    (3UL)    /*!<RRM AGC11_DIG_ENG: ATT_LNA_1 (Bit 3) */
#define RRM_AGC11_DIG_ENG_ATT_LNA_1_Msk                                    (0x8UL)    /*!< RRM AGC11_DIG_ENG: ATT_LNA_1 (Bitfield-Mask: 0x01) */
#define RRM_AGC11_DIG_ENG_ATT_LNA_1                                        RRM_AGC11_DIG_ENG_ATT_LNA_1_Msk
#define RRM_AGC11_DIG_ENG_ATT_IF_1_Pos                                     (0UL)    /*!<RRM AGC11_DIG_ENG: ATT_IF_1 (Bit 0) */
#define RRM_AGC11_DIG_ENG_ATT_IF_1_Msk                                     (0x7UL)    /*!< RRM AGC11_DIG_ENG: ATT_IF_1 (Bitfield-Mask: 0x07) */
#define RRM_AGC11_DIG_ENG_ATT_IF_1                                         RRM_AGC11_DIG_ENG_ATT_IF_1_Msk
#define RRM_AGC11_DIG_ENG_ATT_IF_1_0                                       (0x1U << RRM_AGC11_DIG_ENG_ATT_IF_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_IF_1_1                                       (0x2U << RRM_AGC11_DIG_ENG_ATT_IF_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_IF_1_2                                       (0x4U << RRM_AGC11_DIG_ENG_ATT_IF_1_Pos)

/* =====================================================    AGC12_DIG_ENG    =====================================================*/
#define RRM_AGC12_DIG_ENG_ATT_ANT_2_Pos                                    (4UL)    /*!<RRM AGC12_DIG_ENG: ATT_ANT_2 (Bit 4) */
#define RRM_AGC12_DIG_ENG_ATT_ANT_2_Msk                                    (0x30UL)   /*!< RRM AGC12_DIG_ENG: ATT_ANT_2 (Bitfield-Mask: 0x03) */
#define RRM_AGC12_DIG_ENG_ATT_ANT_2                                        RRM_AGC12_DIG_ENG_ATT_ANT_2_Msk
#define RRM_AGC12_DIG_ENG_ATT_ANT_2_0                                      (0x1U << RRM_AGC12_DIG_ENG_ATT_ANT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_ANT_2_1                                      (0x2U << RRM_AGC12_DIG_ENG_ATT_ANT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_LNA_2_Pos                                    (3UL)    /*!<RRM AGC12_DIG_ENG: ATT_LNA_2 (Bit 3) */
#define RRM_AGC12_DIG_ENG_ATT_LNA_2_Msk                                    (0x8UL)    /*!< RRM AGC12_DIG_ENG: ATT_LNA_2 (Bitfield-Mask: 0x01) */
#define RRM_AGC12_DIG_ENG_ATT_LNA_2                                        RRM_AGC12_DIG_ENG_ATT_LNA_2_Msk
#define RRM_AGC12_DIG_ENG_ATT_IF_2_Pos                                     (0UL)    /*!<RRM AGC12_DIG_ENG: ATT_IF_2 (Bit 0) */
#define RRM_AGC12_DIG_ENG_ATT_IF_2_Msk                                     (0x7UL)    /*!< RRM AGC12_DIG_ENG: ATT_IF_2 (Bitfield-Mask: 0x07) */
#define RRM_AGC12_DIG_ENG_ATT_IF_2                                         RRM_AGC12_DIG_ENG_ATT_IF_2_Msk
#define RRM_AGC12_DIG_ENG_ATT_IF_2_0                                       (0x1U << RRM_AGC12_DIG_ENG_ATT_IF_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_IF_2_1                                       (0x2U << RRM_AGC12_DIG_ENG_ATT_IF_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_IF_2_2                                       (0x4U << RRM_AGC12_DIG_ENG_ATT_IF_2_Pos)

/* =====================================================    AGC13_DIG_ENG    =====================================================*/
#define RRM_AGC13_DIG_ENG_ATT_ANT_3_Pos                                    (4UL)    /*!<RRM AGC13_DIG_ENG: ATT_ANT_3 (Bit 4) */
#define RRM_AGC13_DIG_ENG_ATT_ANT_3_Msk                                    (0x30UL)   /*!< RRM AGC13_DIG_ENG: ATT_ANT_3 (Bitfield-Mask: 0x03) */
#define RRM_AGC13_DIG_ENG_ATT_ANT_3                                        RRM_AGC13_DIG_ENG_ATT_ANT_3_Msk
#define RRM_AGC13_DIG_ENG_ATT_ANT_3_0                                      (0x1U << RRM_AGC13_DIG_ENG_ATT_ANT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_ANT_3_1                                      (0x2U << RRM_AGC13_DIG_ENG_ATT_ANT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_LNA_3_Pos                                    (3UL)    /*!<RRM AGC13_DIG_ENG: ATT_LNA_3 (Bit 3) */
#define RRM_AGC13_DIG_ENG_ATT_LNA_3_Msk                                    (0x8UL)    /*!< RRM AGC13_DIG_ENG: ATT_LNA_3 (Bitfield-Mask: 0x01) */
#define RRM_AGC13_DIG_ENG_ATT_LNA_3                                        RRM_AGC13_DIG_ENG_ATT_LNA_3_Msk
#define RRM_AGC13_DIG_ENG_ATT_IF_3_Pos                                     (0UL)    /*!<RRM AGC13_DIG_ENG: ATT_IF_3 (Bit 0) */
#define RRM_AGC13_DIG_ENG_ATT_IF_3_Msk                                     (0x7UL)    /*!< RRM AGC13_DIG_ENG: ATT_IF_3 (Bitfield-Mask: 0x07) */
#define RRM_AGC13_DIG_ENG_ATT_IF_3                                         RRM_AGC13_DIG_ENG_ATT_IF_3_Msk
#define RRM_AGC13_DIG_ENG_ATT_IF_3_0                                       (0x1U << RRM_AGC13_DIG_ENG_ATT_IF_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_IF_3_1                                       (0x2U << RRM_AGC13_DIG_ENG_ATT_IF_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_IF_3_2                                       (0x4U << RRM_AGC13_DIG_ENG_ATT_IF_3_Pos)

/* =====================================================    AGC14_DIG_ENG    =====================================================*/
#define RRM_AGC14_DIG_ENG_ATT_ANT_4_Pos                                    (4UL)    /*!<RRM AGC14_DIG_ENG: ATT_ANT_4 (Bit 4) */
#define RRM_AGC14_DIG_ENG_ATT_ANT_4_Msk                                    (0x30UL)   /*!< RRM AGC14_DIG_ENG: ATT_ANT_4 (Bitfield-Mask: 0x03) */
#define RRM_AGC14_DIG_ENG_ATT_ANT_4                                        RRM_AGC14_DIG_ENG_ATT_ANT_4_Msk
#define RRM_AGC14_DIG_ENG_ATT_ANT_4_0                                      (0x1U << RRM_AGC14_DIG_ENG_ATT_ANT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_ANT_4_1                                      (0x2U << RRM_AGC14_DIG_ENG_ATT_ANT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_LNA_4_Pos                                    (3UL)    /*!<RRM AGC14_DIG_ENG: ATT_LNA_4 (Bit 3) */
#define RRM_AGC14_DIG_ENG_ATT_LNA_4_Msk                                    (0x8UL)    /*!< RRM AGC14_DIG_ENG: ATT_LNA_4 (Bitfield-Mask: 0x01) */
#define RRM_AGC14_DIG_ENG_ATT_LNA_4                                        RRM_AGC14_DIG_ENG_ATT_LNA_4_Msk
#define RRM_AGC14_DIG_ENG_ATT_IF_4_Pos                                     (0UL)    /*!<RRM AGC14_DIG_ENG: ATT_IF_4 (Bit 0) */
#define RRM_AGC14_DIG_ENG_ATT_IF_4_Msk                                     (0x7UL)    /*!< RRM AGC14_DIG_ENG: ATT_IF_4 (Bitfield-Mask: 0x07) */
#define RRM_AGC14_DIG_ENG_ATT_IF_4                                         RRM_AGC14_DIG_ENG_ATT_IF_4_Msk
#define RRM_AGC14_DIG_ENG_ATT_IF_4_0                                       (0x1U << RRM_AGC14_DIG_ENG_ATT_IF_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_IF_4_1                                       (0x2U << RRM_AGC14_DIG_ENG_ATT_IF_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_IF_4_2                                       (0x4U << RRM_AGC14_DIG_ENG_ATT_IF_4_Pos)

