stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    AGC15_DIG_ENG    =====================================================*/
#define RRM_AGC15_DIG_ENG_ATT_ANT_5_Pos                                    (4UL)    /*!<RRM AGC15_DIG_ENG: ATT_ANT_5 (Bit 4) */
#define RRM_AGC15_DIG_ENG_ATT_ANT_5_Msk                                    (0x30UL)   /*!< RRM AGC15_DIG_ENG: ATT_ANT_5 (Bitfield-Mask: 0x03) */
#define RRM_AGC15_DIG_ENG_ATT_ANT_5                                        RRM_AGC15_DIG_ENG_ATT_ANT_5_Msk
#define RRM_AGC15_DIG_ENG_ATT_ANT_5_0                                      (0x1U << RRM_AGC15_DIG_ENG_ATT_ANT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_ANT_5_1                                      (0x2U << RRM_AGC15_DIG_ENG_ATT_ANT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_LNA_5_Pos                                    (3UL)    /*!<RRM AGC15_DIG_ENG: ATT_LNA_5 (Bit 3) */
#define RRM_AGC15_DIG_ENG_ATT_LNA_5_Msk                                    (0x8UL)    /*!< RRM AGC15_DIG_ENG: ATT_LNA_5 (Bitfield-Mask: 0x01) */
#define RRM_AGC15_DIG_ENG_ATT_LNA_5                                        RRM_AGC15_DIG_ENG_ATT_LNA_5_Msk
#define RRM_AGC15_DIG_ENG_ATT_IF_5_Pos                                     (0UL)    /*!<RRM AGC15_DIG_ENG: ATT_IF_5 (Bit 0) */
#define RRM_AGC15_DIG_ENG_ATT_IF_5_Msk                                     (0x7UL)    /*!< RRM AGC15_DIG_ENG: ATT_IF_5 (Bitfield-Mask: 0x07) */
#define RRM_AGC15_DIG_ENG_ATT_IF_5                                         RRM_AGC15_DIG_ENG_ATT_IF_5_Msk
#define RRM_AGC15_DIG_ENG_ATT_IF_5_0                                       (0x1U << RRM_AGC15_DIG_ENG_ATT_IF_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_IF_5_1                                       (0x2U << RRM_AGC15_DIG_ENG_ATT_IF_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_IF_5_2                                       (0x4U << RRM_AGC15_DIG_ENG_ATT_IF_5_Pos)

/* =====================================================    AGC16_DIG_ENG    =====================================================*/
#define RRM_AGC16_DIG_ENG_ATT_ANT_6_Pos                                    (4UL)    /*!<RRM AGC16_DIG_ENG: ATT_ANT_6 (Bit 4) */
#define RRM_AGC16_DIG_ENG_ATT_ANT_6_Msk                                    (0x30UL)   /*!< RRM AGC16_DIG_ENG: ATT_ANT_6 (Bitfield-Mask: 0x03) */
#define RRM_AGC16_DIG_ENG_ATT_ANT_6                                        RRM_AGC16_DIG_ENG_ATT_ANT_6_Msk
#define RRM_AGC16_DIG_ENG_ATT_ANT_6_0                                      (0x1U << RRM_AGC16_DIG_ENG_ATT_ANT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_ANT_6_1                                      (0x2U << RRM_AGC16_DIG_ENG_ATT_ANT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_LNA_6_Pos                                    (3UL)    /*!<RRM AGC16_DIG_ENG: ATT_LNA_6 (Bit 3) */
#define RRM_AGC16_DIG_ENG_ATT_LNA_6_Msk                                    (0x8UL)    /*!< RRM AGC16_DIG_ENG: ATT_LNA_6 (Bitfield-Mask: 0x01) */
#define RRM_AGC16_DIG_ENG_ATT_LNA_6                                        RRM_AGC16_DIG_ENG_ATT_LNA_6_Msk
#define RRM_AGC16_DIG_ENG_ATT_IF_6_Pos                                     (0UL)    /*!<RRM AGC16_DIG_ENG: ATT_IF_6 (Bit 0) */
#define RRM_AGC16_DIG_ENG_ATT_IF_6_Msk                                     (0x7UL)    /*!< RRM AGC16_DIG_ENG: ATT_IF_6 (Bitfield-Mask: 0x07) */
#define RRM_AGC16_DIG_ENG_ATT_IF_6                                         RRM_AGC16_DIG_ENG_ATT_IF_6_Msk
#define RRM_AGC16_DIG_ENG_ATT_IF_6_0                                       (0x1U << RRM_AGC16_DIG_ENG_ATT_IF_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_IF_6_1                                       (0x2U << RRM_AGC16_DIG_ENG_ATT_IF_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_IF_6_2                                       (0x4U << RRM_AGC16_DIG_ENG_ATT_IF_6_Pos)

/* =====================================================    AGC17_DIG_ENG    =====================================================*/
#define RRM_AGC17_DIG_ENG_ATT_ANT_7_Pos                                    (4UL)    /*!<RRM AGC17_DIG_ENG: ATT_ANT_7 (Bit 4) */
#define RRM_AGC17_DIG_ENG_ATT_ANT_7_Msk                                    (0x30UL)   /*!< RRM AGC17_DIG_ENG: ATT_ANT_7 (Bitfield-Mask: 0x03) */
#define RRM_AGC17_DIG_ENG_ATT_ANT_7                                        RRM_AGC17_DIG_ENG_ATT_ANT_7_Msk
#define RRM_AGC17_DIG_ENG_ATT_ANT_7_0                                      (0x1U << RRM_AGC17_DIG_ENG_ATT_ANT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_ANT_7_1                                      (0x2U << RRM_AGC17_DIG_ENG_ATT_ANT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_LNA_7_Pos                                    (3UL)    /*!<RRM AGC17_DIG_ENG: ATT_LNA_7 (Bit 3) */
#define RRM_AGC17_DIG_ENG_ATT_LNA_7_Msk                                    (0x8UL)    /*!< RRM AGC17_DIG_ENG: ATT_LNA_7 (Bitfield-Mask: 0x01) */
#define RRM_AGC17_DIG_ENG_ATT_LNA_7                                        RRM_AGC17_DIG_ENG_ATT_LNA_7_Msk
#define RRM_AGC17_DIG_ENG_ATT_IF_7_Pos                                     (0UL)    /*!<RRM AGC17_DIG_ENG: ATT_IF_7 (Bit 0) */
#define RRM_AGC17_DIG_ENG_ATT_IF_7_Msk                                     (0x7UL)    /*!< RRM AGC17_DIG_ENG: ATT_IF_7 (Bitfield-Mask: 0x07) */
#define RRM_AGC17_DIG_ENG_ATT_IF_7                                         RRM_AGC17_DIG_ENG_ATT_IF_7_Msk
#define RRM_AGC17_DIG_ENG_ATT_IF_7_0                                       (0x1U << RRM_AGC17_DIG_ENG_ATT_IF_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_IF_7_1                                       (0x2U << RRM_AGC17_DIG_ENG_ATT_IF_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_IF_7_2                                       (0x4U << RRM_AGC17_DIG_ENG_ATT_IF_7_Pos)

/* =====================================================    AGC18_DIG_ENG    =====================================================*/
#define RRM_AGC18_DIG_ENG_ATT_ANT_8_Pos                                    (4UL)    /*!<RRM AGC18_DIG_ENG: ATT_ANT_8 (Bit 4) */
#define RRM_AGC18_DIG_ENG_ATT_ANT_8_Msk                                    (0x30UL)   /*!< RRM AGC18_DIG_ENG: ATT_ANT_8 (Bitfield-Mask: 0x03) */
#define RRM_AGC18_DIG_ENG_ATT_ANT_8                                        RRM_AGC18_DIG_ENG_ATT_ANT_8_Msk
#define RRM_AGC18_DIG_ENG_ATT_ANT_8_0                                      (0x1U << RRM_AGC18_DIG_ENG_ATT_ANT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_ANT_8_1                                      (0x2U << RRM_AGC18_DIG_ENG_ATT_ANT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_LNA_8_Pos                                    (3UL)    /*!<RRM AGC18_DIG_ENG: ATT_LNA_8 (Bit 3) */
#define RRM_AGC18_DIG_ENG_ATT_LNA_8_Msk                                    (0x8UL)    /*!< RRM AGC18_DIG_ENG: ATT_LNA_8 (Bitfield-Mask: 0x01) */
#define RRM_AGC18_DIG_ENG_ATT_LNA_8                                        RRM_AGC18_DIG_ENG_ATT_LNA_8_Msk
#define RRM_AGC18_DIG_ENG_ATT_IF_8_Pos                                     (0UL)    /*!<RRM AGC18_DIG_ENG: ATT_IF_8 (Bit 0) */
#define RRM_AGC18_DIG_ENG_ATT_IF_8_Msk                                     (0x7UL)    /*!< RRM AGC18_DIG_ENG: ATT_IF_8 (Bitfield-Mask: 0x07) */
#define RRM_AGC18_DIG_ENG_ATT_IF_8                                         RRM_AGC18_DIG_ENG_ATT_IF_8_Msk
#define RRM_AGC18_DIG_ENG_ATT_IF_8_0                                       (0x1U << RRM_AGC18_DIG_ENG_ATT_IF_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_IF_8_1                                       (0x2U << RRM_AGC18_DIG_ENG_ATT_IF_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_IF_8_2                                       (0x4U << RRM_AGC18_DIG_ENG_ATT_IF_8_Pos)

/* =====================================================    AGC19_DIG_ENG    =====================================================*/
#define RRM_AGC19_DIG_ENG_ATT_ANT_9_Pos                                    (4UL)    /*!<RRM AGC19_DIG_ENG: ATT_ANT_9 (Bit 4) */
#define RRM_AGC19_DIG_ENG_ATT_ANT_9_Msk                                    (0x30UL)   /*!< RRM AGC19_DIG_ENG: ATT_ANT_9 (Bitfield-Mask: 0x03) */
#define RRM_AGC19_DIG_ENG_ATT_ANT_9                                        RRM_AGC19_DIG_ENG_ATT_ANT_9_Msk
#define RRM_AGC19_DIG_ENG_ATT_ANT_9_0                                      (0x1U << RRM_AGC19_DIG_ENG_ATT_ANT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_ANT_9_1                                      (0x2U << RRM_AGC19_DIG_ENG_ATT_ANT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_LNA_9_Pos                                    (3UL)    /*!<RRM AGC19_DIG_ENG: ATT_LNA_9 (Bit 3) */
#define RRM_AGC19_DIG_ENG_ATT_LNA_9_Msk                                    (0x8UL)    /*!< RRM AGC19_DIG_ENG: ATT_LNA_9 (Bitfield-Mask: 0x01) */
#define RRM_AGC19_DIG_ENG_ATT_LNA_9                                        RRM_AGC19_DIG_ENG_ATT_LNA_9_Msk
#define RRM_AGC19_DIG_ENG_ATT_IF_9_Pos                                     (0UL)    /*!<RRM AGC19_DIG_ENG: ATT_IF_9 (Bit 0) */
#define RRM_AGC19_DIG_ENG_ATT_IF_9_Msk                                     (0x7UL)    /*!< RRM AGC19_DIG_ENG: ATT_IF_9 (Bitfield-Mask: 0x07) */
#define RRM_AGC19_DIG_ENG_ATT_IF_9                                         RRM_AGC19_DIG_ENG_ATT_IF_9_Msk
#define RRM_AGC19_DIG_ENG_ATT_IF_9_0                                       (0x1U << RRM_AGC19_DIG_ENG_ATT_IF_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_IF_9_1                                       (0x2U << RRM_AGC19_DIG_ENG_ATT_IF_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_IF_9_2                                       (0x4U << RRM_AGC19_DIG_ENG_ATT_IF_9_Pos)

