stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    RXADC_HW_TRIM_OUT    =====================================================*/
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos                     (3UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk                     (0x38UL)   /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos                     (0UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk                     (0x7UL)    /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)

/* =====================================================    CBIAS0_HW_TRIM_OUT    =====================================================*/
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos                     (4UL)    /*!<RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Msk                     (0xf0UL)   /*!< RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM                         RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos                     (0UL)    /*!<RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Msk                     (0xfUL)    /*!< RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM                         RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)

/* =====================================================    AGC_HW_TRIM_OUT    =====================================================*/
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos                       (1UL)    /*!<RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bit 1) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk                       (0xeUL)    /*!< RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bitfield-Mask: 0x07) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM                           RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_0                         (0x1U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_1                         (0x2U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_2                         (0x4U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)

/* =====================================================    ANTSW0_DIG_USR    =====================================================*/
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos                           (0UL)    /*!<RRM ANTSW0_DIG_USR: RX_TIME_TO_SAMPLE (Bit 0) */
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Msk                           (0x7fUL)   /*!< RRM ANTSW0_DIG_USR: RX_TIME_TO_SAMPLE (Bitfield-Mask: 0x7f) */
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE                               RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Msk
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_0                             (0x1U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_1                             (0x2U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_2                             (0x4U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_3                             (0x8U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_4                             (0x10U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_5                             (0x20U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)
#define RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_6                             (0x40U << RRM_ANTSW0_DIG_USR_RX_TIME_TO_SAMPLE_Pos)

/* =====================================================    ANTSW1_DIG_USR    =====================================================*/
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos                           (0UL)    /*!<RRM ANTSW1_DIG_USR: RX_TIME_TO_SWITCH (Bit 0) */
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Msk                           (0x3fUL)   /*!< RRM ANTSW1_DIG_USR: RX_TIME_TO_SWITCH (Bitfield-Mask: 0x3f) */
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH                               RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Msk
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_0                             (0x1U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_1                             (0x2U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_2                             (0x4U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_3                             (0x8U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_4                             (0x10U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_5                             (0x20U << RRM_ANTSW1_DIG_USR_RX_TIME_TO_SWITCH_Pos)

