stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb09.h
/* =====================================================    ANTSW2_DIG_USR    =====================================================*/
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos                           (0UL)    /*!<RRM ANTSW2_DIG_USR: TX_TIME_TO_SWITCH (Bit 0) */
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Msk                           (0x7fUL)   /*!< RRM ANTSW2_DIG_USR: TX_TIME_TO_SWITCH (Bitfield-Mask: 0x7f) */
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH                               RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Msk
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_0                             (0x1U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_1                             (0x2U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_2                             (0x4U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_3                             (0x8U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_4                             (0x10U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_5                             (0x20U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)
#define RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_6                             (0x40U << RRM_ANTSW2_DIG_USR_TX_TIME_TO_SWITCH_Pos)

/* =====================================================    ANTSW3_DIG_USR    =====================================================*/
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos                        (0UL)    /*!<RRM ANTSW3_DIG_USR: TX_TIME_TO_SWITCH_2M (Bit 0) */
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Msk                        (0x7fUL)   /*!< RRM ANTSW3_DIG_USR: TX_TIME_TO_SWITCH_2M (Bitfield-Mask: 0x7f) */
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M                            RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Msk
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_0                          (0x1U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_1                          (0x2U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_2                          (0x4U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_3                          (0x8U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_4                          (0x10U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_5                          (0x20U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)
#define RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_6                          (0x40U << RRM_ANTSW3_DIG_USR_TX_TIME_TO_SWITCH_2M_Pos)


/** @} */ /* End of group PosMask_peripherals */

/** @addtogroup Exported_macros
  * @{
  */

/*********************** UART Instances : Asynchronous mode *******************/
#define IS_UART_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** UART Instances : FIFO mode ***************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == LPUART1))

/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** USART Instances : Synchronous mode *******************/
#define IS_USART_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** USART Instances : Auto Baud Rate detection ***********/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** UART Instances : Half-Duplex mode ********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                 ((INSTANCE) == LPUART1))

/*********************** UART Instances : LIN mode ****************************/
#define IS_UART_LIN_INSTANCE(INSTANCE)    ((INSTANCE) == USART1)

/*********************** UART Instances : Hardware Flow control ***************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == LPUART1))

/*********************** UART Instances : Smard card mode *********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) ((INSTANCE) == USART1)


/*********************** UART Instances : Driver Enable ***********************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1)|| \
                                                  ((INSTANCE) == LPUART1))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** UART Instances : Wake-up from Stop mode **************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) ((INSTANCE) == LPUART1)

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1)

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Channel1) || \
                                       ((INSTANCE) == DMA1_Channel2) || \
                                       ((INSTANCE) == DMA1_Channel3) || \
                                       ((INSTANCE) == DMA1_Channel4) || \
                                       ((INSTANCE) == DMA1_Channel5) || \
                                       ((INSTANCE) == DMA1_Channel6) || \
                                       ((INSTANCE) == DMA1_Channel7) || \
                                       ((INSTANCE) == DMA1_Channel8))

/******************************** DMAMUX Instances ****************************/
#define IS_DMAMUX_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DMAMUX1)

